[
  {
    "word": "Creed",
    "definition": "a set of beliefs that influences the way you live / principes"
  },
  {
    "word": "Peculiar",
    "definition": "unusual and strange, sometimes in an unpleasant way / étrange bizarre"
  },
  {
    "word": "Subordinate",
    "definition": "to put someone or something into a less important position, can also come in meaning of tabi3in - subordinates of someone, tbai3in dyalou"
  },
  {
    "word": "Expel",
    "definition": "force someone to leave"
  },
  {
    "word": "Distraught",
    "definition": "extremely worried, nervous, or upset"
  },
  {
    "word": "Distort",
    "definition": "to change the shape of something so that it looks strange or unnatural or so that it is false or wrong, or no longer means what it was intended to mean"
  },
  {
    "word": "Per se",
    "definition": "by or of itself (en lui/elle meme)"
  },
  {
    "word": "impinge on/upon something",
    "definition": "to have a bad effect on (something) Her work is impinging on her social life"
  },
  {
    "word": "Fickle",
    "definition": "likely to change your opinion or your feelings suddenly and without a good reason, used or in general likely to change suddenly and without warning, for weather as well"
  },
  {
    "word": "Endowment",
    "definition": "1- money that is given to a college, hospital, etc. in order to provide it with an income, or the giving of this money 2-something that you have from birth, often a quality"
  },
  {
    "word": "Heretic",
    "definition": "someone who has an opinion that is opposite to or against the official or popular opinion, or religion"
  },
  {
    "word": "contend with something",
    "definition": "to have to deal with a difficult or unpleasant situation"
  },
  {
    "word": "pertain to something",
    "definition": "to relate to or have a connection with something: regulations pertaining to high-tech industries"
  },
  {
    "word": "Spunky",
    "definition": "energetic, confident, and determined / used to describe a man who is sexually attractive"
  },
  {
    "word": "holistic",
    "definition": "relating to the whole of something or to the total system instead of just to its parts"
  },
  {
    "word": "Preside",
    "definition": "to be in charge of or to control a meeting or event: The vice president will preside at today’s meeting."
  },
  {
    "word": "Exhilaration",
    "definition": "excitement and happiness"
  },
  {
    "word": "Rancor",
    "definition": "a feeling of hate and continuing anger about something in the past, rancune"
  },
  {
    "word": "Bound",
    "definition": "certain or extremely likely to happen / having a moral or legal duty to do something. She feels (duty)-bound to tell him everything / tied with rope, cord, string, etc.: / going to: / to mark or form the limits of: The town is bounded on one side by a river."
  },
  {
    "word": "Limp",
    "definition": "to walk slowly and with difficulty because of having an injured or painful leg or foot"
  },
  {
    "word": "Infatuation",
    "definition": "strong but not usually lasting feelings of love or attraction"
  },
  {
    "word": "Undermine",
    "definition": "to gradually weaken or destroy someone or something"
  },
  {
    "word": "Expedite",
    "definition": "make (an action or process) happen sooner or be accomplished more quickly."
  },
  {
    "word": "Spike",
    "definition": "..."
  },
  {
    "word": "Snap",
    "definition": "to cause something that is thin to break suddenly and quickly with a cracking sound: You'll snap that ruler if you bend it too far / to suddenly become unable to control a strong feeling, especially anger: When she asked me to postpone my trip to help her move to her new house, I just snapped (= got angry). / to quickly return to a previous place or condition: snap back After substantial losses last year, the company has snapped back to profitability (= started making profits again)."
  },
  {
    "word": "Untapped",
    "definition": "If a supply of something valuable is untapped, it is not yet used or taken advantage of."
  },
  {
    "word": "Muddle",
    "definition": "an untidy or confused state"
  },
  {
    "word": "Muddle through",
    "definition": "to manage to do something although you are not organized and do not know how to do it"
  },
  {
    "word": "Gaslight",
    "definition": "the psychological manipulation tactic known as 'gaslighting,' which involves making someone doubt their own reality or sanity."
  },
  {
    "word": "County",
    "definition": "region, departement, 3amala (Texas has 254 counties)"
  },
  {
    "word": "rule something or someone out",
    "definition": "to decide or say officially that something is impossible or will not happen, or that something or someone is not suitable: to stop considering something as a possibility:"
  },
  {
    "word": "Heave",
    "definition": "to move something heavy using a lot of effort: to throw something forcefully, especially something large and heavy:"
  },
  {
    "word": "Fleet",
    "definition": "group of vehicles, object, people, warships / can also be used as an adjective to describe something that is fast or swift / 'Fleeting' is an adjective that describes something that is brief, transitory, or short-lived. It is often used to refer to experiences, moments, or events that don't last very long and pass by quickly."
  },
  {
    "word": "Uptight",
    "definition": "worried or nervous and not able to relax"
  },
  {
    "word": "Blitz",
    "definition": "rapid and intense military attack / marketing : an intensive and concentrated effort to promote a product / In informal language, 'blitz' can be used more broadly to describe any rapid, intense, or aggressive action or effort. For example, someone might say they're going to 'blitz through their homework' to convey the idea of completing it quickly."
  },
  {
    "word": "Reverent",
    "definition": "showing great respect and admiration"
  },
  {
    "word": "Undertake",
    "definition": "to do or begin to do something, especially something that will take a long time or be difficult: He needs to undertake a proper cashflow and budgeting exercise. / to promise that you will do something: All banks have undertaken to give printouts on request of standing orders / to pass another vehicle that is going in the same direction as you by driving past it on the left side: threading the needle is an idiomatic expression that is often used to describe a situation where someone skillfully navigates a difficult or narrow passage"
  },
  {
    "word": "Staple",
    "definition": "a main product or part of something: Shortages mean that even staples (= basic foods) like bread are difficult to find. Phosphate has been a staple of this area for many years. / basic or main; standard or regular:"
  },
  {
    "word": "Latch",
    "definition": "sa9ta , to close, or close something, with a latch"
  },
  {
    "word": "Conspicuous",
    "definition": "very noticeable or attracting attention, often in a way that is not wanted: (mfrout)"
  },
  {
    "word": "Pushback",
    "definition": "negative reaction to a change or to something new that has been introduced: There's plenty of pushback from environmentalists."
  },
  {
    "word": "up to scratch",
    "definition": "up to the required standard; satisfactory. 'Her German was not up to scratch.'"
  },
  {
    "word": "Haul",
    "definition": "to pull something heavy slowly and with difficulty: / a usually large amount of something that has been stolen or is illegal: a haul of arms and drugs / all the things someone buys on an occasion when they go shopping: shopping haul Check out the Ucinek family shopping haul."
  },
  {
    "word": "Expedient",
    "definition": "opportun, helpful or useful in the situation that now exists, although perhaps not the right thing to do morally: it is expedient to do sth It might be expedient not to pay him until some time after the work is finished."
  },
  {
    "word": "Strut",
    "definition": "to walk with your chest pushed forward and your shoulders back to show you are proud:"
  },
  {
    "word": "Carriage return",
    "definition": "retour a la ligne"
  },
  {
    "word": "Butler",
    "definition": "the most important male servant in a house:"
  },
  {
    "word": "Blowhard",
    "definition": "a person who likes to talk about how important they are"
  },
  {
    "word": "Barn",
    "definition": "grange, étable , zriba"
  },
  {
    "word": "Alleviate",
    "definition": "soulage, alléger, apaiser"
  },
  {
    "word": "Exacerbate",
    "definition": "exacerber , to make something that is already bad even worse:"
  },
  {
    "word": "Pus",
    "definition": "l9i7 dyal hbouba"
  },
  {
    "word": "Prickly",
    "definition": "unfriendly and easily offended or annoyed: / complicated and difficult to deal with: / covered with prickles: (épin, chouk)"
  },
  {
    "word": "Brothel",
    "definition": "a place where men go and pay to have sex with prostitutes"
  },
  {
    "word": "Power cut",
    "definition": "la panne d'électricité, Coupure de courant"
  },
  {
    "word": "Bowel",
    "definition": "Intestin / the bowels of something = the parts of something that are furthest away from the outside: The fire started deep in the bowels of the ship."
  },
  {
    "word": "Distill",
    "definition": "sti9tar to get or show only the most important part of something: Over 80 hours of footage have been distilled into these 40 minutes. She distilled the report into a paragraph."
  },
  {
    "word": "Bellboy",
    "definition": "a person employed to carry bags, open doors, etc. for guests in a hotel:"
  },
  {
    "word": "Vantage point",
    "definition": "a place, especially a high place, that provides a good, clear view of an area: / a particular personal way of thinking or set of opinions:"
  },
  {
    "word": "Compromise",
    "definition": "to risk harming something / to reduce your demands in order to reach an agreement: != Uncompromising fixed and not easily changed:"
  },
  {
    "word": "Put the pedal to the metal",
    "definition": "to work or drive quickly"
  },
  {
    "word": "Write off",
    "definition": "to decide that a particular person or thing will not be useful, important, or successful / to accept that an amount of money has been lost or that a debt will not be paid: The World Bank is being urged to write off debts from developing countries."
  },
  {
    "word": "Misnomer",
    "definition": "a name that does not suit what it refers to, or the use of such a name: terme ou nom inapproprié"
  },
  {
    "word": "Suit yourself",
    "definition": "to do what one wants to do, an expression used either humorously or angrily to mean 'do what you want to do': DIR LIBGHITI"
  },
  {
    "word": "Intercede",
    "definition": "to use your influence to persuade someone in authority to forgive another person, or save this person from punishment:"
  },
  {
    "word": "Duress",
    "definition": "threats used to force a person to do something: He signed the contract under duress."
  },
  {
    "word": "Overstretched",
    "definition": "not having enough money, people, equipment, etc.: Hospitals are overstretched, and patients are not getting the treatment they need. / having more work or other activities than you can manage:"
  },
  {
    "word": "Temperament",
    "definition": "tab3 aw mizaj , the part of your character that affects your moods and the way you behave:"
  },
  {
    "word": "Nitpick",
    "definition": "to find faults in details that are not important: You're always nitpicking - it's so annoying!"
  },
  {
    "word": "Illustrious",
    "definition": "famous, well respected, and admired:"
  },
  {
    "word": "cross my heart (and hope to die)",
    "definition": "said to show that what you have just said or promised is completely true or sincere"
  },
  {
    "word": "Adamant",
    "definition": "categorique, impossible to persuade, or unwilling to change an opinion or decision:"
  },
  {
    "word": "Insurgent",
    "definition": "someone who is fighting against the government in their own country:"
  },
  {
    "word": "Concussion",
    "definition": "temporary damage to the brain caused by a fall or hit on the head or by violent shaking:"
  },
  {
    "word": "Stint",
    "definition": "a fixed or limited period of time spent doing a particular job or activity: / to provide, take, or use only a small amount of something: Don't stint yourself - take another slice of cake. / To limit, restrict, or economize on something, often with the implication of doing so in a sparing or inadequate manner. For example, 'They had to stint on their vacation budget this year.'"
  },
  {
    "word": "Vacancy",
    "definition": "a space or place that is available to be used:We wanted to book a hotel room in July but there were no vacancies./a job that no one is doing and is therefore available for someone new to do:There is a vacancy for a shop assistant on Saturdays."
  },
  {
    "word": "Relinquish",
    "definition": "to give up something such as a responsibility or claim:He has relinquished his claim to the throne. AND to unwillingly stop holding or keeping something:She relinquished her hold/grip on the steering wheel."
  },
  {
    "word": "Foregoing",
    "definition": "involving what has just been mentioned or described:"
  },
  {
    "word": "Dawdle",
    "definition": "glander, tourner les pouces"
  },
  {
    "word": "Proceeding",
    "definition": "procedure"
  },
  {
    "word": "Peachy",
    "definition": "very good"
  },
  {
    "word": "Ambush",
    "definition": "to suddenly attack someone after hiding and waiting for them - embuscade"
  },
  {
    "word": "Defiance-defiant",
    "definition": "behaviour in which you refuse to obey someone or something:"
  },
  {
    "word": "Longing",
    "definition": "a feeling of wanting something or someone very much:"
  },
  {
    "word": "Led astray",
    "definition": "detourné du droit chemin"
  },
  {
    "word": "Deplorable",
    "definition": "very bad"
  },
  {
    "word": "Find your groove",
    "definition": "In Work: In a professional context, it means that someone has found a way of working or a routine that suits them well, leading to increased productivity and satisfaction. In Sports: Athletes might talk about finding their groove when they're performing at their best and everything seems to click. In Daily Life: People might use this phrase when they're feeling comfortable and confident in their daily routines or activities."
  },
  {
    "word": "Make amends",
    "definition": "to do something good to show that you are sorry about something you have done"
  },
  {
    "word": "Recant",
    "definition": "retracter, to announce in public that your past beliefs or statements were wrong or not true and that you no longer agree with them:"
  },
  {
    "word": "Sack",
    "definition": "A Bag: In its most basic sense, a \"sack\" is a bag typically made of cloth, burlap, or some other material, used to carry or store items. For example, a sack might be used to transport grain, potatoes, or other bulk materials. Or also a sleeping bag / Termination from Employment: In a workplace context, to be \"sacked\" means to be fired or terminated from your job. It's a colloquial term for losing one's job."
  },
  {
    "word": "Dicy",
    "definition": "For example, if someone says a decision is \"dicy,\" they mean that it's a bit risky or uncertain, and the outcome is not guaranteed."
  },
  {
    "word": "Heed",
    "definition": "to listen to and follow advice: The airline failed to heed warnings about security."
  },
  {
    "word": "Acquaintance",
    "definition": "connaissance , a person that you have met but do not know well:"
  },
  {
    "word": "Guile",
    "definition": "clever but sometimes dishonest behaviour that you use to deceive someone: The president will need to use all her political guile to stay in power."
  },
  {
    "word": "Belittle",
    "definition": "to make a person or an action seem as if he, she or it is not important:"
  },
  {
    "word": "Contingency",
    "definition": "something that might possibly happen in the future, usually causing problems or making further arrangements necessary: You must be able to deal with all possible contingencies."
  },
  {
    "word": "Calous",
    "definition": "unkind, cruel, and without sympathy or feeling for other people: It might sound callous, but I don't care if he's homeless. He's not living with me!"
  },
  {
    "word": "Somersault",
    "definition": "to roll or jump, either forwards or backwards, turning over completely, with your body above your head, and finish with your head on top again:"
  },
  {
    "word": "Scrub",
    "definition": "if an event is \"scrubbed,\" it means it has been postponed or called off/ In a general sense, \"scrub\" can mean to clean or wash something vigorously/In some contexts, \"scrub\" means to carefully review, inspect, or examine something in great detail"
  },
  {
    "word": "Impersonal",
    "definition": "without human warmth; not friendly and without features that make people feel interested or involved:She has a very cold and impersonal manner./not referring to people or a particular person by name:He always tried to keep the discussions impersonal so that no one would be offended./not existing as a person:Some religions favour the idea of an impersonal god."
  },
  {
    "word": "Smother",
    "definition": "to kill someone by covering their face so that they cannot breathe:They threatened to smother the animals with plastic bags./to stop a fire from burning by covering it with something that prevents air from reaching it:I threw a blanket over the stove to smother the flames./to prevent something from developing or growing freely:The latest violence has smothered any remaining hopes for an early peace agreement./to give someone too much love and attention so that they do not feel independent or free:I think she broke off their engagement because she felt smothered by him."
  },
  {
    "word": "Trample",
    "definition": "to step heavily on something or someone, causing damage or injury:/to act without any respect for someone or something:She accused the government of trampling on the needs and rights of the ordinary citizen."
  },
  {
    "word": "Amok",
    "definition": "to be out of control and act in a wild or dangerous manner:The soldiers ran amok after one of their senior officers was killed."
  },
  {
    "word": "Yank",
    "definition": "to pull something forcefully with a quick movement:She yanked open the cupboard door and everything fell out."
  },
  {
    "word": "Brash / brashly",
    "definition": "showing too much confidence and too little respect:"
  },
  {
    "word": "Triage",
    "definition": "the process of quickly examining patients who are taken to a hospital in order to decide which ones are the most seriously ill and must be treated first:"
  },
  {
    "word": "Depravity",
    "definition": "the state of being morally bad, or an action that is morally bad"
  },
  {
    "word": "Amnesty",
    "definition": "amnestie, a decision by a government to forgive people who have committed particular illegal acts or crimes, and not to punish them:"
  },
  {
    "word": "dull-witted",
    "definition": "slow to understand or learn; not very intelligent:"
  },
  {
    "word": "Wits",
    "definition": "intelligence and the ability to think quickly:"
  },
  {
    "word": "Dull",
    "definition": "to make something such as a feeling less sharp and strong, or to become less sharp and strong:/to become or make something become less clear, bright, or shiny:/not interesting or exciting in any way:"
  },
  {
    "word": "Herald",
    "definition": "to announce or signal that something is approaching: The trade agreement heralded a new era of economic development."
  },
  {
    "word": "Sham",
    "definition": "something that is not what it seems to be and is intended to deceive people, or someone who pretends to be something they are not: It turned out that he wasn't a real doctor at all - he was just a sham./ To pretend"
  },
  {
    "word": "Yore",
    "definition": "of a long time ago: This was once a Roman road in days of yore."
  },
  {
    "word": "Full-fledged",
    "definition": "completely developed or trained: Washington wants to avoid a full-fledged war. Within months the student had become a full-fledged instructor."
  },
  {
    "word": "Quid pro quo",
    "definition": "something that is given to a person in return for something they have done:"
  },
  {
    "word": "Intel",
    "definition": "secret information, for example about another country's government, an enemy group, or criminal activities: What was the point of getting a man onto the base if it wasn’t to gather intel?"
  },
  {
    "word": "Slumber",
    "definition": "sleep"
  },
  {
    "word": "Inviolate",
    "definition": "intact, not harmed or damaged:For centuries the tomb lay inviolate until, by chance, it was discovered by two miners."
  },
  {
    "word": "Stir up",
    "definition": "provoquer, attiser /to cause an unpleasant emotion or problem to begin or grow The teacher told him to stop stirring up trouble."
  },
  {
    "word": "Yearn",
    "definition": "to wish very strongly, especially for something that you cannot have or something that is very difficult to have:"
  },
  {
    "word": "Purport",
    "definition": "to pretend to be or to do something, especially in a way that is not easy to believe:They purport to represent the wishes of the majority of parents at the school./the general meaning of someone's words or actions:I didn't read it all but I think the purport of the letter was that he will not be returning for at least a year. = signifier"
  },
  {
    "word": "Jolt",
    "definition": "a sudden violent movement:As the plane touched the ground, there was a massive jolt and we were thrown forwards."
  },
  {
    "word": "Ought to",
    "definition": "used to express something that you expect will happen:He ought to be home by seven o'clock./used to show when it is necessary or would be a good thing to perform the activity referred to by the following verb: You ought to be kinder to him."
  },
  {
    "word": "Hammer something out",
    "definition": "to reach an agreement or solution after a lot of argument or discussion:Three years after the accident the lawyers finally managed to hammer out a settlement with the insurance company."
  },
  {
    "word": "Fleecy",
    "definition": "is an adjective used to describe something that is soft, fluffy, and covered with a downy or woolly texture, resembling the fleece of a sheep"
  },
  {
    "word": "Idyllic",
    "definition": "An idyllic place or experience is extremely pleasant, beautiful, or peaceful:"
  },
  {
    "word": "Dean",
    "definition": "doyen (d'une universite par exemple)"
  },
  {
    "word": "Plead",
    "definition": "to make an urgent, emotional statement or request for something:He was on his knees, pleading for mercy/forgiveness. / also used in context of court : The defendant pleaded not guilty/innocent to robbery with violence"
  },
  {
    "word": "Wane",
    "definition": "to become weaker in strength or influence:By the late 70s the band's popularity was beginning to wane."
  },
  {
    "word": "Derpy",
    "definition": "describe something or someone as being clumsy, awkward, or foolish in a cute or endearing way."
  },
  {
    "word": "Imbue something/someone with something",
    "definition": "impregner, to fill something or someone with a particular feeling, quality, or idea: His poetry is imbued with deep, religious feeling."
  },
  {
    "word": "Cunning",
    "definition": "the quality or skill of being clever at planning something so you get what you want, especially by tricking other people: We need to show some cunning if we want to defeat the enemy."
  },
  {
    "word": "Frantic",
    "definition": "frénétique, done in a very great hurry and often in a state of excitement or confusion: Rescuers made frantic efforts to dig out people buried by the mudslide, When someone or something is described as \"frantic,\" it means they are acting with extreme urgency, anxiety, or agitation."
  },
  {
    "word": "Soundly",
    "definition": "completely, deeply"
  },
  {
    "word": "Breadth",
    "definition": "largeur / Breadth is also the range or areas of knowledge or ability that someone has: The breadth of his knowledge of history was impressive."
  },
  {
    "word": "Balm",
    "definition": "an oil that comes from particular tropical trees and is used especially to treat injuries or reduce pain:"
  },
  {
    "word": "Nipped in the bud",
    "definition": "is a figurative way of saying that something has been stopped or prevented from developing further"
  },
  {
    "word": "Nip",
    "definition": "to go somewhere quickly or be somewhere for only a short time: Can you nip out/round/down to the shop for me?/to press something quickly and quite hard between two objects, especially sharp objects such as teeth or nails:/If there is a nip in the air, the air outside is quite cold:"
  },
  {
    "word": "Deplete",
    "definition": "to reduce something in size or amount, especially supplies of energy, money, etc.:Acid rain depletes the region’s fish stocks."
  },
  {
    "word": "Tick someone off",
    "definition": "to speak severely to and criticize someone who has done something wrong: I had to tick him off for being late again."
  },
  {
    "word": "Tick something off",
    "definition": "cocher de la liste"
  },
  {
    "word": "Stay put",
    "definition": "(of a person or object) remain somewhere without moving or being moved."
  },
  {
    "word": "Embalming",
    "definition": "the process of preserving a corpse by treating it with chemicals. In French: embaumer"
  },
  {
    "word": "Outpatient",
    "definition": "a person who receives medical care from a hospital but who does not stay in the hospital for one or more nights:"
  },
  {
    "word": "Probe",
    "definition": "to examine something with a tool, especially in order to find something that is hidden:/to try to discover information that other people do not want you to know, by asking questions carefully and not directly:. Detectives questioned him for hours, probing for any inconsistencies in his story."
  },
  {
    "word": "Condescend",
    "definition": "to behave in a way which shows that you consider yourself to be better or more intelligent than other people:He treats his players fairly and never condescends to them./If you condescend to do something, you agree to do something that you do not consider to be good enough for your social position: I wonder if Michael will condescend to visit us?"
  },
  {
    "word": "Tenure",
    "definition": "being the legal owner of land, a job, or an official public position, or the period of time during which you own it:"
  },
  {
    "word": "Revamp",
    "definition": "to change or arrange something again, in order to improve it:"
  },
  {
    "word": "Incredulously",
    "definition": "in a way that shows you do not want or are unable to believe something: \"Did you see that?\" she asked incredulously."
  },
  {
    "word": "Chide",
    "definition": "to speak to someone severely because they have behaved badly: She chided him for his bad manners."
  },
  {
    "word": "Get a grip on yourself",
    "definition": "to control your emotions:"
  },
  {
    "word": "String someone along",
    "definition": "to deceive someone for a long time about what you are really intending to do: She's been promising to pay back the money for six months, but I think she's just stringing me along."
  },
  {
    "word": "String along something",
    "definition": "to arrange things in a line:Occasional gas stations and small markets are strung along the roads."
  },
  {
    "word": "Fiddle around",
    "definition": "to spend time doing small things that are not important or necessary: I was just fiddling around in the kitchen."
  },
  {
    "word": "Fiddle (around) with something",
    "definition": "to make small changes to something to try to make it work:"
  },
  {
    "word": "Contempt",
    "definition": "a strong feeling of disliking and having no respect for someone or something: contempt for At school she had complete contempt for all her teachers. treat someone/somethingwith contempt You should treat those remarks with the contempt that they deserve. beneath contempt She's beneath contempt (= I have no respect for her)!/ behaviour that is illegal because it does not obey or respect the rules of a law court:"
  },
  {
    "word": "Fixture",
    "definition": "a permanently fixed piece of furniture in a house, such as a bath, that would not be taken by someone when moving to a new home:/a day and usually a time agreed for a sports event:"
  },
  {
    "word": "Frothy",
    "definition": "entertaining and easily understood, but not serious or intended to make you think:Her first novel was a frothy romantic comedy./used to describe a market in which the prices of assets are beginning to rise above their real value because of high demand:/(of a liquid) with small white bubbles on the surface:Beat the mixture until it becomes frothy. (mousseux)"
  },
  {
    "word": "Ovation",
    "definition": "loud clapping that expresses a crowd’s great enjoyment or approval of something"
  },
  {
    "word": "Ludicrous",
    "definition": "ridiculous or foolish, stupid or unreasonable and deserving to be laughed at: a ludicrous idea/suggestion"
  },
  {
    "word": "Perjury",
    "definition": "the crime of telling lies in court when you have promised to tell the truth"
  },
  {
    "word": "Tow",
    "definition": "remorquer, to pull a car, boat, etc. along, fastened behind another vehicle or boat:"
  },
  {
    "word": "Hazy",
    "definition": "not remembering things clearly:hazy memories of childhood / not clear because of haze (= fog):a hazy day/sky"
  },
  {
    "word": "All hands",
    "definition": "typically refers to the entire crew or staff of a ship, organization, or company"
  },
  {
    "word": "Dread",
    "definition": "to feel extremely worried or frightened about something that is going to happen or that might happen:He's dreading the exam - he's sure he's going to fail."
  },
  {
    "word": "Unwind",
    "definition": "If you unwind something that is wrapped around an object, you unfasten it, and if it unwinds, it becomes unfastened:/to relax and allow your mind to be free from worry after a period of work:"
  },
  {
    "word": "Ponder",
    "definition": "to think carefully about something, especially for a noticeable length of time:She sat back for a minute to ponder her next move in the game."
  },
  {
    "word": "Dreary",
    "definition": "boring and making you feel unhappy"
  },
  {
    "word": "Stub",
    "definition": "the short part of something that is left after the main part has been used, especially a cigarette after it has been smoked or one of the small pieces of paper left in a book from which cheques or tickets have been torn"
  },
  {
    "word": "Stub your toe",
    "definition": "to hurt your toe by hitting it against a hard object by accident"
  },
  {
    "word": "Dismay",
    "definition": "a feeling of unhappiness and disappointment"
  },
  {
    "word": "Consternation",
    "definition": "a feeling of dismay or unease"
  },
  {
    "word": "Utterly",
    "definition": "completely or extremely"
  },
  {
    "word": "Absolve",
    "definition": "to free someone from guilt, blame, or responsibility"
  },
  {
    "word": "Congruence",
    "definition": "the quality of being similar to or in agreement with something"
  },
  {
    "word": "Jugular",
    "definition": "relating to the throat or neck"
  },
  {
    "word": "Atrophy",
    "definition": "to be reduced in size and therefore strength, or, more generally, to become weaker"
  },
  {
    "word": "Therein",
    "definition": "in or into a particular place, thing, etc."
  },
  {
    "word": "Mellow out",
    "definition": "to become more relaxed"
  },
  {
    "word": "Mellow",
    "definition": "gentle, smooth, or soft in character"
  },
  {
    "word": "Intricacy",
    "definition": "the quality of having a lot of complicated small parts or details"
  },
  {
    "word": "Discord",
    "definition": "the state of not agreeing or sharing opinions"
  },
  {
    "word": "Invigorate",
    "definition": "to give new energy or strength to someone or something"
  },
  {
    "word": "Lark",
    "definition": "an activity done for enjoyment or amusement"
  },
  {
    "word": "Withered",
    "definition": "dry and decaying"
  },
  {
    "word": "Wouldn't be caught dead",
    "definition": "is used to say that you really don't like something or wouldn't want to be seen in that situation"
  },
  {
    "word": "Fuss",
    "definition": "the condition of being excited, annoyed, or not satisfied about something"
  },
  {
    "word": "Haggle",
    "definition": "to bargain or negotiate"
  },
  {
    "word": "Stash",
    "definition": "To hide or store something carefully and usually secretly, often for future use."
  },
  {
    "word": "Recede",
    "definition": "To move back or away from a previous position or level"
  },
  {
    "word": "Ballot",
    "definition": "a system or occasion of secret voting"
  },
  {
    "word": "Premeditated",
    "definition": "To think about, plan, or arrange in advance, especially a crime or harmful action."
  },
  {
    "word": "Incongruous",
    "definition": "Not in harmony or keeping with the surroundings or other aspects of something; out of place."
  },
  {
    "word": "Sedentary",
    "definition": "Involving or requiring much sitting; characterized by a lack of physical activity or exercise."
  },
  {
    "word": "Dry run",
    "definition": "a rehearsal of a performance or procedure before the real one."
  },
  {
    "word": "Stale",
    "definition": "no longer new or fresh, usually as a result of being kept for too long"
  },
  {
    "word": "Flea market",
    "definition": "a market where old or used goods are sold cheaply"
  },
  {
    "word": "Repulsive",
    "definition": "extremely unpleasant or unacceptable"
  },
  {
    "word": "Edge Case",
    "definition": "A scenario or input that is at the extreme, unusual, or boundary of a system's design or operation."
  },
  {
    "word": "Shake it off",
    "definition": "to dismiss or disregard negative feelings, criticism, or setbacks"
  },
  {
    "word": "Put out",
    "definition": "to agree to have sex"
  },
  {
    "word": "Hush up",
    "definition": "to suppress or keep something quiet"
  },
  {
    "word": "See off",
    "definition": "to bid farewell to someone"
  },
  {
    "word": "For what it's worth",
    "definition": "an idiom used to introduce a statement or opinion"
  },
  {
    "word": "Tip off",
    "definition": "to inform in advance"
  },
  {
    "word": "Fellowship",
    "definition": "friendly association, especially with people who share one's interests"
  },
  {
    "word": "Instill",
    "definition": "to gradually but firmly introduce or impress a quality, idea, or feeling into someone's mind"
  },
  {
    "word": "Cushion",
    "definition": "To cushion means to soften the impact of something or to provide support and comfort."
  },
  {
    "word": "Astute",
    "definition": "perceptive, clever, and quick in understanding and making accurate judgments"
  },
  {
    "word": "Clutch",
    "definition": "to grasp or seize tightly"
  },
  {
    "word": "Tally",
    "definition": "a record or count of a number of things"
  },
  {
    "word": "Putter",
    "definition": "to do things in a relaxed way, without rushing or trying very hard"
  },
  {
    "word": "Ramification",
    "definition": "the possible result of a decision or action"
  },
  {
    "word": "Crop",
    "definition": "Recolte"
  },
  {
    "word": "Hunch",
    "definition": "A feeling or intuition about something, often without logical evidence"
  },
  {
    "word": "Tumultuous",
    "definition": "characterized by disorder, confusion, or noisy"
  },
  {
    "word": "Welfare state",
    "definition": "a political system in which the government assumes the responsibility for the well-being of its citizens"
  },
  {
    "word": "Fizzle out",
    "definition": "to gradually lose strength, momentum, or interest"
  },
  {
    "word": "Bloating",
    "definition": "abnormal swelling or increase in size"
  },
  {
    "word": "Siphon off",
    "definition": "to divert or take away a portion of something"
  },
  {
    "word": "Divert",
    "definition": "to change the direction or course of something"
  },
  {
    "word": "Munge",
    "definition": "to transform or manipulate data in a way that might be considered kludgy or not elegant"
  },
  {
    "word": "Mischievous",
    "definition": "slightly annoying or slightly bad, especially in a playful way"
  },
  {
    "word": "Boogers",
    "definition": "nasal mucus"
  },
  {
    "word": "Throttle",
    "definition": "to control the flow of a fluid; to prevent something from succeeding"
  },
  {
    "word": "Blight",
    "definition": "to spoil, harm, or destroy"
  },
  {
    "word": "Feckless",
    "definition": "lacking in efficiency, initiative, or determination"
  },
  {
    "word": "Weed out",
    "definition": "to remove or eliminate unwanted or unnecessary elements"
  },
  {
    "word": "Vet",
    "definition": "to examine carefully to make certain that it is acceptable or suitable"
  },
  {
    "word": "Dubious",
    "definition": "doubtful, questionable, or uncertain"
  },
  {
    "word": "Impiety",
    "definition": "lack of reverence or disrespect toward a deity or religious principles"
  },
  {
    "word": "Settle in",
    "definition": "to become established or comfortable in a new place or situation"
  },
  {
    "word": "Settle",
    "definition": "to establish a residence/ to come to a resolution or agreement, to gradually sink or fall/ to calm down or make comfortable/ to pay off a debt or fulfill an obligation"
  },
  {
    "word": "Compunction",
    "definition": "a feeling of guilt, uneasiness, or remorse"
  },
  {
    "word": "Atone",
    "definition": "to make amends for a wrongdoing"
  },
  {
    "word": "Misty",
    "definition": "not remembering things clearly; not clear because of haze"
  },
  {
    "word": "Stall",
    "definition": "As a Verb: To stop or cause to stop making progress Exemple : The car engine started to stall in the middle of the road. To delay or procrastinate. As a Noun: A compartment or space for one animal in a stable. A temporary booth, stand, or counter for selling goods. As a Noun:A compartment or space for one animal in a stable: Each horse had its own stall in the barn.A temporary booth, stand, or counter for selling goods: She set up a stall at the local market to sell handmade crafts."
  },
  {
    "word": "Contingency",
    "definition": "Noun that refers to a future event or circumstance that is possible but cannot be predicted with certainty. It often involves the preparation for or consideration of alternative plans or courses of action in case the anticipated situation does not unfold as expected."
  },
  {
    "word": "Rustle",
    "definition": "To move with quiet, gentle sounds or whispers, often suggesting secretive or furtive movement. To obtain or gather something quickly or informally."
  },
  {
    "word": "Deprave",
    "definition": "To corrupt, degrade, or lead someone or something away from moral or ethical principles."
  },
  {
    "word": "Frown upon",
    "definition": "To disapprove of something, to regard it with displeasure, or to show disapproval through facial expressions or attitude."
  },
  {
    "word": "Kosher",
    "definition": "To describe something that is in accordance with Jewish dietary laws (kashrut) or is acceptable or legitimate in a broader sense."
  },
  {
    "word": "Severance",
    "definition": "Refers to the action of ending a connection, relationship, or tie. It can have various specific meanings depending on the context, Employment Context: A severance package is a compensation package provided by an employer to an employee upon termination of employment.Legal Context:The severance of a legal relationship or obligation implies the formal ending or dissolution of that relationship."
  },
  {
    "word": "Transpire",
    "definition": "To occur or take place. To be revealed or disclosed."
  },
  {
    "word": "Bedrock",
    "definition": "The fundamental or basic principles on which something, such as an idea or system, is grounded or built."
  },
  {
    "word": "Waft",
    "definition": "To float or be carried through the air, typically describing the gentle movement of scents, sounds, or light."
  },
  {
    "word": "Fumble",
    "definition": "To handle something clumsily or awkwardly, especially when trying to grasp or manipulate it. It can also refer to making a mistake or error, particularly in sports when a player mishandles the ball."
  },
  {
    "word": "Avail",
    "definition": "Add to word list use, purpose, advantage, or profit."
  },
  {
    "word": "Down to the wire",
    "definition": "An idiom often implies that the outcome is uncertain and will be determined at the last possible moment."
  },
  {
    "word": "Covet",
    "definition": "To envy or strongly desire something possessed by another."
  },
  {
    "word": "Bigoted",
    "definition": "Describes someone who holds strong and intolerant views, especially regarding other people's race, religion, or politics. A bigoted person is often unwilling to consider alternative perspectives and may express prejudice or discrimination."
  },
  {
    "word": "Steepness",
    "definition": "The degree of incline or slope."
  },
  {
    "word": "Subjugate",
    "definition": "To bring under control, domination, or subordination, often through force or oppressive means."
  },
  {
    "word": "Expenditure",
    "definition": "Expense or spending."
  },
  {
    "word": "Stalwart",
    "definition": "Describes someone or something as strong, loyal, reliable, and unwavering in support."
  },
  {
    "word": "Lead on",
    "definition": "To Guide or Direct: Definition: 'Lead on' can be an invitation or encouragement for someone to guide or direct others, often implying a willingness to follow. To Deceive or Mislead: In some contexts, 'lead on' can mean to deceive or mislead someone, especially in a romantic or interpersonal relationship."
  },
  {
    "word": "Devise",
    "definition": "To invent, plan, or create something, especially a complex system, method, or strategy. 'A devise' (with an 's') can also be a noun, referring to a clause in a will that determines the distribution of the testator's estate."
  },
  {
    "word": "Quirky",
    "definition": "Adjective used to describe something or someone that is characterized by peculiar or unconventional qualities, often in an endearing or amusing way. Quirky things are typically unusual or unexpected."
  },
  {
    "word": "Gloomy",
    "definition": "An adjective that describes something as dark, dim, or lacking in brightness. It is often used to convey a sense of darkness, heaviness, or a lack of cheerfulness."
  },
  {
    "word": "Penurious",
    "definition": "An adjective that describes someone who is extremely poor, impoverished, or lacking the means to meet basic needs. It can also be used more broadly to characterize something that is miserly, stingy, or extremely frugal."
  },
  {
    "word": "Hawker",
    "definition": "Refers to someone who sells goods, typically food, in a street or public place. Hawkers often carry their merchandise with them or use a small cart or stall for selling."
  },
  {
    "word": "Nudge",
    "definition": "To encourage or persuade someone to do something in a way that is gentle rather than forceful or direct. To push something or someone gently to attract attention. To move slowly and almost reach a higher point or level."
  },
  {
    "word": "Raspy",
    "definition": "Used to describe a harsh, rough sound, particularly in the voice."
  },
  {
    "word": "Dissonance",
    "definition": "Noun that refers to a lack of harmony or agreement, especially in musical or auditory contexts. It can also be used more broadly to describe a discordant or conflicting combination of elements, ideas, or opinions."
  },
  {
    "word": "Drudge",
    "definition": "Is a person who does hard, menial, or dull work, often without enthusiasm. As a verb means to engage in hard, tedious, or menial work."
  },
  {
    "word": "Tune in to",
    "definition": "To encourage someone to pay attention or become aware of something happening or being discussed."
  },
  {
    "word": "Fringe",
    "definition": "Outer part of an area. To form a border around the edge of something. The outer or less important part of an area, group, or activity."
  },
  {
    "word": "Tepid",
    "definition": "Not very warm."
  },
  {
    "word": "Sign off (on something)",
    "definition": "To formally approve or agree to something."
  },
  {
    "word": "Sign off",
    "definition": "To give a final message at the end of a letter or communication."
  },
  {
    "word": "Ethereal",
    "definition": "Light and delicate, especially in an unnatural way."
  },
  {
    "word": "Giddy",
    "definition": "Feeling silly, happy, and excited and showing this in your behavior. Having a slight feeling of spinning around or being unable to balance; slightly dizzy."
  },
  {
    "word": "Jarring",
    "definition": "Adjective used to describe something that is incongruous, discordant, or causing a strong and unpleasant reaction due to a sharp contrast or unexpected element."
  },
  {
    "word": "Antsy",
    "definition": "Very nervous, worried, or unpleasantly excited."
  },
  {
    "word": "Adage",
    "definition": "A wise saying, comme proverbe."
  },
  {
    "word": "Satiating",
    "definition": "Adjective that describes the quality of satisfying hunger or fulfilling a desire, often used in the context of food or other appetites."
  },
  {
    "word": "Flatulance",
    "definition": "Gas intestinaux."
  },
  {
    "word": "Demeanor",
    "definition": "Comportement."
  },
  {
    "word": "Waffled",
    "definition": "To be indecisive or to vacillate between different options or opinions, often resulting in a lack of a clear or firm decision. To speak or write at length in a vague or evasive manner, often without providing a straightforward answer."
  },
  {
    "word": "Unequivocally",
    "definition": "Adverb that means in a clear and unambiguous manner, leaving no room for doubt or confusion. It signifies a statement or action that is straightforward and indisputable."
  },
  {
    "word": "Tongue-lashing",
    "definition": "Speak angrily to that person about something that they have done wrong."
  },
  {
    "word": "To be in a pickle",
    "definition": "To find oneself in a difficult or challenging situation."
  },
  {
    "word": "Convoluted",
    "definition": "Compliqué."
  },
  {
    "word": "Brat",
    "definition": "A child one who behaves badly."
  },
  {
    "word": "Rogue",
    "definition": "It can refer to a person who behaves in a dishonest, unprincipled, or unpredictable manner, often engaging in unlawful activities. Can describe something that is unpredictable, deviates from the norm, or is not under control."
  },
  {
    "word": "Rat out",
    "definition": "Means to inform on or betray someone by revealing their secrets, misconduct, or wrongdoing to authorities or others."
  },
  {
    "word": "Fess up",
    "definition": "Confesser, avouer."
  },
  {
    "word": "Stingy",
    "definition": "Avare, radin."
  },
  {
    "word": "Skimp",
    "definition": "To be stingy or to use less of something, often in a way that is insufficient or inadequate. It can also imply cutting corners or not putting in enough effort or resources into a task or project."
  },
  {
    "word": "Prolific",
    "definition": "Refers to someone or something that produces a large quantity of something, often creative works, offspring, or results."
  },
  {
    "word": "Anguish",
    "definition": "Is a severe mental or physical pain, torment, or distress. It often involves intense suffering or agony."
  },
  {
    "word": "Brush up",
    "definition": "Means to refresh or improve one's skills, knowledge, or understanding of a particular subject, typically by reviewing or practicing."
  },
  {
    "word": "Sparingly",
    "definition": "Refers to using or doing something in a limited or restrained manner, often with frugality or moderation."
  },
  {
    "word": "Avid",
    "definition": "Extremely eager or interested."
  },
  {
    "word": "Hearse",
    "definition": "Voiture likayhzo biha lmouta f mirikan."
  },
  {
    "word": "Emancipate",
    "definition": "Means to set free or liberate from legal, social, or political restrictions. It is often used in the context of freeing someone from slavery or oppression."
  },
  {
    "word": "turf",
    "definition": "Pelouse"
  },
  {
    "word": "sprain",
    "definition": " injury to a ligament, fr : entorse"
  },
  {
    "word": "unsavory",
    "definition": " describes something that is unpleasant, distasteful, morally questionable, or disagreeable, ex : an unsavory reputation"
  },
  {
    "word": "lair",
    "definition": "a place where a wild animal lives, often underground and hidden, or a place where a person hides:, fr : taniere"
  },
  {
    "word": "trickle",
    "definition": " describes the slow and steady flow or movement of a liquid, usually in small quantities or droplets, fr :  Ruisseler or Couler au goutte-à-goutte"
  },
  {
    "word": "preset",
    "definition": "As a noun, refers to a setting or value that is preconfigured or predetermined, especially in the context of electronic devices or machinery, As an adjective, describes something that has been established or arranged in advance, typically referring to settings, parameters, or conditions that are predetermined or fixed, fr : Prédéfini"
  },
  {
    "word": "pep talk",
    "definition": "is an informal speech or conversation aimed at motivating, encouraging, or inspiring someone to perform better, overcome obstacles, or boost their morale"
  },
  {
    "word": "parlay",
    "definition": "to use or develop money, skills, etc. in a way that makes more money or leads to success:They parlayed a small inheritance into a vast fortune"
  },
  {
    "word": "self-starter",
    "definition": "is a person who demonstrates initiative, motivation, and the ability to work independently without needing external motivation or supervision. fr : Autonome or Personne motivée et proactive"
  },
  {
    "word": "mash",
    "definition": "to crush food, usually after cooking it, so that it forms a soft mass/to violently crush part of a body or an object:His face was badly mashed up in the accident. fr : ecraser, et puree dans contexte food"
  },
  {
    "word": "wade",
    "definition": "to walk in water that is not very deep:/ wade into something : to become involved in a difficult situation, often without thinking about it carefully"
  },
  {
    "word": "adversity",
    "definition": "refers to difficulties, challenges, or hardships that one faces in life : She was always cheerful in adversity."
  },
  {
    "word": "presumptuous",
    "definition": "Qui a une idée trop avantageuse de soi-même, qui a une confiance excessive en soi. Presomptueux"
  },
  {
    "word": "fixer-upper",
    "definition": "is a property, typically a house or building, that is in need of repairs, renovations, or improvements. It usually requires significant work to make it habitable or desirable, but it is often purchased at a lower price with the intention of renovating and increasing its value."
  },
  {
    "word": "tag alone",
    "definition": "To follow or accompany someone, especially without being invited. : My little brother wanted to tag along with me and my friends to the movie theater. fr : accompagner quelquun"
  },
  {
    "word": "Linger",
    "definition": " To stay in a place longer than necessary, typically because of a reluctance to leave.She lingered at the cafe, sipping her coffee slowly and watching the world go by. Fr : sattarder"
  },
  {
    "word": "Dynamics",
    "definition": "more over the usual definiton : Dynamics refer to the forces or properties that stimulate growth, development, or change within a system or process, especially relating to the way people or things interact with each other.Understanding the dynamics of team interactions is crucial for improving workplace productivity and harmony."
  },
  {
    "word": "Jog your memory",
    "definition": " is an idiomatic expression that means to stimulate someone's memory to recall something, often by providing a hint or reminder.Seeing her old school photo jogged her memory about her childhood friends"
  },
  {
    "word": "take on",
    "definition": "to accept a particular job or responsibility:You can't take on responsibility for the whole event. fr : prendre en charge/to employ someone:/to compete against or fight someone:The government took on the unions and won. "
  },
  {
    "word": "get to the bottom of it",
    "definition": " refers to the process of discovering the true facts or underlying truth about a complex or confusing situation or problem.: The detective promised to get to the bottom of the mystery and find out who was responsible."
  },
  {
    "word": "fall short",
    "definition": " to fail to reach a target, standard, or expected level. Despite their best efforts, the team fell short of their goal to win the championship."
  },
  {
    "word": "Nark",
    "definition": "To annoy someone / In British English, it typically refers to a police informant or someone who reports illegal activities to the authorities/a person who complains and spoils other people's enjoyment"
  },
  {
    "word": "void",
    "definition": "a large hole or empty space:/a feeling of unhappiness because someone or something is missing:/having no legal authority and therefore unacceptable:The lawyers declared the contract (null and) void./"
  },
  {
    "word": "rigged",
    "definition": "refers to a situation or outcome that has been dishonestly arranged or manipulated to ensure a specific result, often in an unfair or fraudulent way.: The competition was rigged, with the judges favoring their preferred contestants. fr : truquer"
  },
  {
    "word": "hiatus",
    "definition": "refers to a pause or gap in a sequence, series, or process.: The band took a five-year hiatus before releasing their next album."
  },
  {
    "word": "blow off",
    "definition": "to decide not to do something you are expected to do, or not to meet someone you are expected to meet:Aren’t you going to the meeting? No, I’m going to blow it off/to treat something or someone as if that thing or person were not important:Just blow off his comments - he's only joking."
  },
  {
    "word": "stench",
    "definition": "a strong, unpleasant smell:/a bad effect that follows an unpleasant event or situation and is noticeable for a long time:For some time after the minister's resignation, the stench of scandal hung over the government."
  },
  {
    "word": "yap",
    "definition": "refers to the act of making short, sharp, high-pitched barks or sounds, typically used to describe the noise made by small dogs./to talk continuously:"
  },
  {
    "word": "button up",
    "definition": "can have a literal meaning, referring to the act of fastening the buttons on a piece of clothing. It can also be used figuratively to mean concluding or securing something, or preparing oneself, often for something challenging or serious."
  },
  {
    "word": "Bile",
    "definition": " is a bitter, greenish-brown alkaline fluid that aids digestion and is secreted by the liver and stored in the gallbladder"
  },
  {
    "word": "harpy",
    "definition": "a cruel, unpleasant woman who shouts a lot"
  },
  {
    "word": "gutter talk",
    "definition": "offensive language"
  },
  {
    "word": "gutter",
    "definition": "there's the images/refer to a low or degraded state or level.:His behavior at the party last night was in the gutter, completely lacking in decency or respect."
  },
  {
    "word": "comb through",
    "definition": "to search or examine something thoroughly, usually in a detailed and methodical manner. It often refers to looking for specific information or items among many."
  },
  {
    "word": "Plasterer",
    "definition": "a person whose job is to cover walls and ceilings with plaster. Gbass"
  },
  {
    "word": "Coddle",
    "definition": "to protect someone or something too much:The steel industry is coddled by trade protection and massive subsidies."
  },
  {
    "word": "Venture",
    "definition": "a new activity, usually in business, that involves risk or uncertainty:he advised us to look abroad for more lucrative business ventures."
  },
  {
    "word": "venture on/upon something",
    "definition": "to try to do something difficult or dangerous:"
  },
  {
    "word": "sketchy",
    "definition": "containing few details:Officials provided only sketchy details of the trip./not completely safe or not completely honest:Sketchy guy"
  },
  {
    "word": "lush",
    "definition": "A lush area has a lot of green, healthy plants, grass, and trees:lush green valleys/good or, of a person, attractive:We had a lush time on my birthday. or he's so lush/a person who regularly drinks too much alcohol"
  },
  {
    "word": "vouch",
    "definition": "to be able from your knowledge or experience to say that something is true: I can vouch for his honesty and integrity; he has always been trustworthy in my experience. As a medical examiner I can vouch that his death was accidental"
  },
  {
    "word": "entrapment",
    "definition": "the act of causing someone to do something they would not usually do by tricking them:The defense argued that the defendant was a victim of entrapment, as the undercover officer pressured him into selling drugs."
  },
  {
    "word": "buzzed/buzzed up",
    "definition": "excited/drunk or under the influence of a drug:"
  },
  {
    "word": "Squatter",
    "definition": "a person who unlawfully occupies an uninhabited building or unused land."
  },
  {
    "word": "spot on",
    "definition": "exactly right:His prediction about the election results was spot-on."
  },
  {
    "word": "salvage",
    "definition": "to save goods from damage or destruction, especially from a ship that has sunk or been damaged or a building that has been damaged by fire or a flood:"
  },
  {
    "word": "get out of the funk",
    "definition": "typically means to recover or emerge from a state of depression, sadness, or a general slump in mood or performance. When someone is in a 'funk' they might feel unmotivated, down, or out of sorts without a clear reason"
  },
  {
    "word": "Run for the hills",
    "definition": "to be extremely unwilling to be involved in something, and to avoid it: Investors are likely to run for the hills if the market begins to fall again."
  },
  {
    "word": "indigenous",
    "definition": "used to refer to, or relating to, the people who originally lived in a place, rather than people who moved there from somewhere else :"
  },
  {
    "word": "potent",
    "definition": "very powerful, forceful, or effective: Surprise remains the terrorists' most potent weapon + The Berlin Wall was a potent symbol of the Cold War."
  },
  {
    "word": "inadvertently",
    "definition": "in a way that is not intentional:He inadvertently deleted the file."
  },
  {
    "word": "aggravation",
    "definition": "trouble or difficulty: I've been getting a lot of aggravation at work recently./ the act of making something such as a problem or injury worse: Rest the affected limb to avoid further aggravation of the condition."
  },
  {
    "word": "spar",
    "definition": "to practise boxing, without hitting hard/ to argue"
  },
  {
    "word": "queer",
    "definition": "having or relating to a gender identity or a sexuality that does not fit society's traditional ideas about gender or sexuality:/strange, unusual, or not expected:"
  },
  {
    "word": "rhetoric",
    "definition": "speech or writing intended to be effective and influence people:"
  },
  {
    "word": "visceral",
    "definition": "based on deep feeling and emotional reactions rather than on reason or thought: His approach to acting is visceral rather than intellectual."
  },
  {
    "word": "Point of contention",
    "definition": "is an issue that people disagree about, often leading to arguments or disputes: The proposed location for the new community center has become a major point of contention among the city council members."
  },
  {
    "word": "streamroll",
    "definition": "to overpower or overcome someone or something by force, often without regard for their feelings or opinions. It can also mean to proceed with relentless force in achieving one's objectives: The company decided to steamroll the opposition by pushing forward with their development plans, despite local protests.Fr : ecraser"
  },
  {
    "word": "spin up",
    "definition": " describe the process of quickly setting up or starting a virtual machine, project, or initiative. It can also refer to the rapid development or deployment of resources: We need to spin up a new server to handle the increased traffic to our website. mettre en place rapidement"
  },
  {
    "word": "dust off",
    "definition": "Figuratively, it means to bring something out of disuse or to refresh old skills or knowledge."
  },
  {
    "word": "schism",
    "definition": "a division into two groups caused by a disagreement about ideas, especially in a religious organization:"
  },
  {
    "word": "chapstick",
    "definition": "baume a levre"
  },
  {
    "word": "catering",
    "definition": "any job making or serving food : traiteur"
  },
  {
    "word": "Peripherally",
    "definition": " is an adverb describing something that occurs at or relates to the outer limits or edge of an area or object, often used to imply a position or involvement that is secondary or indirect : He was only peripherally involved in the project, providing occasional advice and feedback."
  },
  {
    "word": "streamline",
    "definition": "to improve the effectiveness of an organization such as a business or government, often by making the way activities are performed simpler:/to change something so that it works better, esp. by making it simpler:"
  },
  {
    "word": "Rizz",
    "definition": "Rizz is a slang term for skill in charming or seducing"
  },
  {
    "word": "felony",
    "definition": "crime, جناية"
  },
  {
    "word": "misdemeanor",
    "definition": "delit جنحة"
  },
  {
    "word": "grunt",
    "definition": "Sound: He let out a grunt as he lifted the heavy box."
  },
  {
    "word": "Rebuke",
    "definition": "fr : Réprimander, To express sharp disapproval or criticism of someone because they have behaved badly."
  },
  {
    "word": "innocuous",
    "definition": "Not harmful or offensive; unlikely to provoke strong emotions or reactions. fr : innocent, ex : His comment was innocuous, merely a casual remark with no intention to offend."
  },
  {
    "word": "to get pegged",
    "definition": " refers to a sexual act where a person (typically a man) receives anal penetration from a woman using a strap-on dildo."
  },
  {
    "word": "have someone pegged",
    "definition": "to understand completely the way someone is or who they are"
  },
  {
    "word": "perk up",
    "definition": " to become or cause someone to become happier, more energetic, or more active: She perked up as soon as I mentioned that Charles was coming to dinner./ to improve or become more exciting:The city is trying to perk up the business district by planting trees."
  },
  {
    "word": "Gimmick",
    "definition": "something invented esp. for the purpose of attracting attention and that has no other purpose or value: The company's new advertising campaign is full of gimmicks to attract customers./Some people think the special effects in the movie are just a gimmick to hide the weak plot. : FR : un peu pres comme astuce ou quelque chose comme ca"
  },
  {
    "word": "hello ",
    "definition": "test",
    "imageUrl": "/images/Untitled.png"
  },
  {
    "word": "Excerpt",
    "definition": "to take a small part from a speech, book, film, etc. in order to publish it separately"
  },
  {
    "word": "cottage",
    "definition": "a small house, usually in the countryside: fr : chalet"
  },
  {
    "word": "recreational",
    "definition": "refers to activities or things related to recreation, leisure, or enjoyment. It describes something intended for relaxation, amusement, or pleasure rather than work or study. For example, a \"activité récréative\" would be a recreational activity such as playing sports, going to the park, or engaging in hobbies."
  },
  {
    "word": "berate",
    "definition": "to criticize or speak in an angry manner to someone:"
  },
  {
    "word": "edgy",
    "definition": "someone or something that is provocative, unconventional, or deliberately challenging social norms or standards. It often implies a sense of being bold, daring, or even slightly shocking. For example, an \"edgy\" style might include fashion choices that are unusual or provocative, while an \"edgy\" personality might be characterized by a willingness to push boundaries and take risks."
  },
  {
    "word": "hazardous",
    "definition": "dangereux"
  },
  {
    "word": "baloney",
    "definition": "nonsense"
  },
  {
    "word": "monastery",
    "definition": "a building in which monks live and worship, fr : monastere"
  },
  {
    "word": "fallible",
    "definition": "Fallible means capable of making mistakes or being wrong.\n Even the most experienced experts are fallible and can make errors.\n"
  },
  {
    "word": "eon",
    "definition": "An eon (or aeon) is an indefinite and very long period of time, often used to describe a major division of geological time."
  },
  {
    "word": "unscathed",
    "definition": "without injuries or damage being caused: Her husband died in the accident but she, amazingly, escaped unscathed."
  },
  {
    "word": "Stampede",
    "definition": "an occasion when many large animals or many people suddenly all move quickly and in an uncontrolled way, usually in the same direction at the same time, especially because of fear:"
  },
  {
    "word": "Amorphous",
    "definition": " means lacking a clear structure or form; not having a definite shape or form. fr : amorphe"
  },
  {
    "word": "palatable",
    "definition": "pleasant to taste; acceptable or satisfactory The chef's new dish was not only innovative but also highly palatable"
  },
  {
    "word": "glean",
    "definition": "to collect information in small amounts and often with difficulty: rom what I was able to glean, the news isn't good."
  },
  {
    "word": "strenuous ",
    "definition": "needing or using a lot of physical or mental effort or energy:I think football is much more strenuous than baseball."
  },
  {
    "word": "impetus",
    "definition": "something that encourages a particular activity or makes that activity more energetic or effective:The recent publicity surrounding homelessness has given (a) fresh impetus to the cause. Fr: elan ??"
  },
  {
    "word": "phase something in",
    "definition": "to introduce something gradually or in stages:"
  },
  {
    "word": "To phase (someone)",
    "definition": "To disturb, unsettle, or upset someone, causing them to become confused or disoriented. : The unexpected change in schedule didn't phase him; he adapted quickly and continued his work without any issues. fr : perturber"
  },
  {
    "word": "coveted",
    "definition": "Highly desired or sought after."
  },
  {
    "word": "Limbo",
    "definition": "A state of uncertainty or being in-between, where progress or resolution is not possible. : After the company merger, many employees felt like they were in limbo, unsure of their future roles. fr : incertitude"
  },
  {
    "word": "snappy ",
    "definition": "effective in getting people's attention or communicating an idea:The magazine will be launched in September with a snappy new design./ modern and stylish:/ annoyed and speaking in an angry way:"
  },
  {
    "word": "embezzle",
    "definition": "to secretly take money that is in your care or that belongs to an organization or business you work for,  fr : détourner des fonds"
  },
  {
    "word": "whizz",
    "definition": "a person with a very high level of skill or knowledge in a particular subject: A computer whizz/ to move or do something very fast: A police car whizzed by, on its way to the accident."
  },
  {
    "word": "Ploy",
    "definition": "ruse : désigne une manœuvre ou un plan astucieux conçu pour tromper ou obtenir un avantage sur quelqu'un."
  },
  {
    "word": "dangle",
    "definition": "to hang loosely, fr : pendre, mdeli Loose electric wires were dangling from the wall."
  },
  {
    "word": "puppet",
    "definition": "image",
    "imageUrl": "/images/image_2024-08-21_123318217.png"
  },
  {
    "word": "flare/flare up",
    "definition": "for flare up : When something bad such as violence, pain, or anger flares (up), it suddenly starts or gets much worse:/ for flare : to (cause to) become wider:The skirt fits tightly over the hips and flares just below the knees."
  },
  {
    "word": "scoot",
    "definition": "slide while sitting : to slide while sitting/ to go quickly: I need to scoot over to the post office."
  },
  {
    "word": "demure",
    "definition": " describe someone, typically a woman, who appears shy, modest, or reserved in a way that is considered attractive or endearing"
  },
  {
    "word": "unhip",
    "definition": "not fashionable, modern, or popular:"
  },
  {
    "word": "slink ",
    "definition": "to walk away from somewhere quietly so that you are not noticed:"
  },
  {
    "word": "pesky",
    "definition": "annoying or causing trouble:"
  },
  {
    "word": "topsy-turvy",
    "definition": "(in a state of being) confused, not well organized, or giving importance to unexpected things:Things are so topsy-turvy at work these days."
  },
  {
    "word": "fudge ",
    "definition": "to avoid making a decision or giving a clear answer about something:The government continues to fudge the issue by refusing to give exact figures."
  },
  {
    "word": "borough",
    "definition": "a town, or a division of a large town"
  },
  {
    "word": "cranky ",
    "definition": "easily annoyed or upset: fr : grincheux, irritable"
  },
  {
    "word": "oblivious",
    "definition": "not conscious of something, especially what is happening around you: She was often oblivious to the potential consequences of her actions."
  },
  {
    "word": "fluster",
    "definition": "to make someone upset and confused, especially when they are trying to do something : perturber"
  },
  {
    "word": "prominent",
    "definition": "very well known and important: / Something that is in a prominent position can easily be seen or noticed: / sticking out from a surface:She has a prominent chin/nose."
  },
  {
    "word": "angle grinder",
    "definition": "image",
    "imageUrl": "/images/image_2024-09-03_131759856.png"
  },
  {
    "word": "taxidermy",
    "definition": "the activity of cleaning, preserving, and filling the skins of dead animals with special material to make them look as if they are still alive"
  },
  {
    "word": "pick up on something",
    "definition": "to start talking again about something that someone said previously:Can I just pick up on your first point again, please?/to notice something that other people have not noticed:Only one newspaper picked up on the contradictions in the statement."
  },
  {
    "word": "lore ",
    "definition": "traditional knowledge and stories about a subject:According to local lore, the water has healing properties."
  },
  {
    "word": "Beefcake / hunk",
    "definition": "are terms often used to describe men who are muscular, attractive, and typically fit"
  },
  {
    "word": "Ladle",
    "definition": "louche",
    "imageUrl": "/images/image_2024-09-13_205719465.png"
  },
  {
    "word": "clad",
    "definition": "(of people) dressed, or (of things) covered:"
  },
  {
    "word": "Turmoil ",
    "definition": "a state of confusion, uncertainty, or disorder: The whole region is in turmoil."
  },
  {
    "word": "aloof",
    "definition": "not interested or involved, usually because you do not approve of what is happening:\nWhatever is happening in the office, she always remains aloof."
  },
  {
    "word": "tend to",
    "definition": "Prendre soin/soccuper de quelqu'un/quelque chose : \n\"I need to tend to my garden\" → \"Je dois prendre soin de mon jardin.\"\n\"She tends to the guests\" → \"Elle s'occupe des invités.\""
  },
  {
    "word": "catcall",
    "definition": "\"catcalling\" is \"harcèlement de rue\" (street harassment), though there are also informal expressions like \"les sifflements\" (whistling) or \"les remarques déplacées\" (inappropriate remarks) to describe it."
  },
  {
    "word": "waive",
    "definition": "renoncer , \"Waive a fee\" can be translated as \"renoncer à des frais\".\"Waive your rights\" would be \"renoncer à vos droits\"."
  },
  {
    "word": "indicted",
    "definition": "\"He was indicted for fraud\" translates to \"Il a été inculpé pour fraude\" or \"Il a été mis en examen pour fraude\"."
  },
  {
    "word": "be (all) the rage",
    "definition": "to be very popular at a particular time:\nLong hair for men was all the rage in the 70s."
  },
  {
    "word": "pimp",
    "definition": "9owad / to make something look fashionable or impressive, usually by adding things to it"
  },
  {
    "word": "regal",
    "definition": "very special and suitable for a king or queen:"
  },
  {
    "word": "dismount",
    "definition": "to get off a horse, bicycle, or motorcycle"
  },
  {
    "word": "understate",
    "definition": "to describe something in a way that makes it seem less important, serious, bad, etc. than it really is:\nShe believes the research understates the amount of discrimination women suffer."
  },
  {
    "word": "morbid",
    "definition": "too interested in unpleasant subjects, especially death:\na morbid fascination with death/relating to or caused by disease:"
  },
  {
    "word": "loom",
    "definition": "If an unwanted or unpleasant event looms, it seems likely to happen soon and causes worry:\nHer final exams are looming./to appear as a large, often frightening or unclear shape or object:\nDark storm clouds loomed on the horizon."
  },
  {
    "word": "ramp",
    "definition": "an artificial slope:\n\na raised strip built into a road to make vehicles drive more slowly : dos d'ane\n\na short road on which vehicles join or leave a main road",
    "imageUrl": "/images/image_2024-10-07_125540571.png"
  },
  {
    "word": "standoff",
    "definition": "a situation in which agreement in an argument does not seem possible / standoffish : behaving in a slightly unfriendly and too formal way"
  },
  {
    "word": "supper",
    "definition": "diner, sometimes referred to be lighter than diner"
  },
  {
    "word": "corny",
    "definition": "(especially of jokes, films, stories, etc.) showing no new ideas or too often repeated, and therefore not funny or interesting: /  sense of being overly sentimental, unoriginal, or exaggerated in a way that lacks subtlety or freshness."
  },
  {
    "word": "bootleg",
    "definition": "illegally made, copied, or sold:\nbootleg CDs/liquor "
  },
  {
    "word": "stammer",
    "definition": "to speak or say something with unusual pauses or repeated sounds, either because of speech problems or because of fear or nervousness :"
  },
  {
    "word": "baste",
    "definition": "to pour hot fat and liquid over meat while it is cooking:"
  },
  {
    "word": "get cold feet",
    "definition": "to suddenly become too frightened to do something you had planned to do, especially something important such as getting married"
  },
  {
    "word": "defector",
    "definition": "someone who leaves a country, political party, etc., especially in order to join an opposing one:"
  },
  {
    "word": "behold",
    "definition": "to see or look at someone or something:\nThe new bridge is an incredible sight to behold."
  },
  {
    "word": "headlock",
    "definition": "especially in wrestling, a way of holding an opponent with your arm around their head so that they cannot move:"
  },
  {
    "word": "pan ",
    "definition": "(of a video camera) to move slowly from one side to another or up and down:\nIn the first scene, the camera pans slowly across the room.",
    "imageUrl": "/images/image_2024-10-15_140003202.png"
  },
  {
    "word": "strand",
    "definition": "to leave someone in a place that they cannot get away from because of a problem such as not having any transport or money: Heavy snow has closed the mountain passes and stranded local residents./ also a beach or shore"
  },
  {
    "word": "amend",
    "definition": "to change something, especially the words of a text:/to make a change to a law:"
  },
  {
    "word": "white collar job",
    "definition": "type of work that typically involves clerical, administrative, or professional duties, often performed in an office setting. It usually requires mental or intellectual labor rather than physical labor, which contrasts with blue-collar jobs that are more manual or industrial./ travail de bureau"
  },
  {
    "word": "glide",
    "definition": "move smoothly and effortlessly, often with minimal resistance or friction. It can describe both physical motion, like that of a bird or a plane, and metaphorical movements like smooth progress in a task. fr : glisser"
  },
  {
    "word": "locked in",
    "definition": "refers to being extremely focused, committed, or dedicated to a task, person, or situation. It can also be used to describe someone who's fully invested in a relationship or goal, or who's \"in the zone\" mentally or physically."
  },
  {
    "word": "heist",
    "definition": "braquage"
  },
  {
    "word": "sketchy",
    "definition": "fr : suspect, louche"
  },
  {
    "word": "speck ",
    "definition": "refers to a very small particle, spot, or mark, usually something so tiny it can be hard to see. It can also be used metaphorically to describe something insignificant or minor."
  },
  {
    "word": "grimy",
    "definition": "dirty, fr: sale"
  },
  {
    "word": "erratic",
    "definition": "Unpredictable, inconsistent, or irregular in behavior, movement, or quality : \"His erratic driving made everyone in the car nervous"
  },
  {
    "word": "tongs",
    "definition": "l9at",
    "imageUrl": "/images/image_2024-10-20_175152483.png"
  },
  {
    "word": "whitewash",
    "definition": "an attempt to stop people finding out the true facts about a situation:\nThis is a politically correct whitewashing of the region's troubles."
  },
  {
    "word": "whitewash",
    "definition": "an attempt to stop people finding out the true facts about a situation:\nThis is a politically correct whitewashing of the region's troubles."
  },
  {
    "word": "hazing",
    "definition": "bizutage"
  },
  {
    "word": "budge",
    "definition": "If something will not budge or you cannot budge it, it will not move:\nI've tried moving the desk but it won't budge. / it can be applied on opinions too"
  },
  {
    "word": "angsty",
    "definition": "often worried or unhappy, especially about personal problems:\nan angsty teenage boy"
  },
  {
    "word": "kick back",
    "definition": "to stop doing things and relax:\nWhat good is life if a guy can’t kick back and watch a good movie?"
  },
  {
    "word": "brace",
    "definition": "plusieur def",
    "imageUrl": "/images/image_2024-11-03_180327485.png"
  },
  {
    "word": "profanity",
    "definition": "words that are offensive because of not respecting religion, or offensive because of being rude:"
  },
  {
    "word": "act up",
    "definition": "If a person, especially a child, acts up, they behave badly:"
  },
  {
    "word": "crook",
    "definition": "a very dishonest person"
  },
  {
    "word": "buttress",
    "definition": "to give support to or strengthen something:\nHe looked for things that would buttress the prosecution case and win a conviction."
  },
  {
    "word": "snoop",
    "definition": "to look around a place secretly, in order to discover things or find out information about someone or something:/ to try to find out about other people's private lives:"
  },
  {
    "word": "swine",
    "definition": "a person who you consider to be extremely unpleasant and unkind / a pig"
  },
  {
    "word": "glee",
    "definition": "happiness, excitement, or pleasure:"
  },
  {
    "word": "Outrage / Ire ",
    "definition": "a feeling of anger and shock:"
  },
  {
    "word": "eatery",
    "definition": "restaurant"
  },
  {
    "word": "pariah",
    "definition": "a person who is not accepted by a social group, especially because they are not liked, respected, or trusted:\nThe scandal transformed him into a pariah."
  },
  {
    "word": "dawdle",
    "definition": "to do something or go somewhere very slowly, taking more time than is necessary:\nStop dawdling! You'll be late for school!"
  },
  {
    "word": "inane",
    "definition": "extremely silly or with no real meaning or importance:"
  },
  {
    "word": "onset",
    "definition": "the moment at which something begins, and especially something uncomfortable or unpleasant:\nthe onset of winter"
  },
  {
    "word": "veer",
    "definition": "to suddenly change direction:"
  },
  {
    "word": "hose",
    "definition": "tuyau",
    "imageUrl": "/images/image_2024-11-18_123422584.png"
  },
  {
    "word": "Outstanding",
    "definition": "very much better than usual; excellent:\nYou’ve done an outstanding job. / not yet paid, solved, or done:\n$450 million in outstanding debts\nThere are still a couple of problems outstanding."
  },
  {
    "word": "stoke ",
    "definition": "to add fuel to a large enclosed fire and move the fuel around so that it burns well and produces a lot of heat: / to encourage bad ideas or feelings in a lot of people:\nHe's been accused of stoking up racial hatred in the region."
  },
  {
    "word": "parch",
    "definition": "to dry something out because of too much heat and not enough rain:\nThe fierce sun parched the soil."
  },
  {
    "word": "Slingshot",
    "definition": "lance-pierre",
    "imageUrl": "/images/image_2024-11-19_124718843.png"
  },
  {
    "word": "elated",
    "definition": "extremely happy and excited, often because something has happened or been achieved:"
  },
  {
    "word": "Composed",
    "definition": "calm and in control of your emotions:"
  },
  {
    "word": "clencher",
    "definition": " refers to a decisive event, play, or move that secures a victory or resolves a contest. For example:\n\n\"The last-minute goal was the clencher for the team.\""
  },
  {
    "word": "ditzy",
    "definition": "a ditzy person, especially a woman, is silly:"
  },
  {
    "word": "Oar",
    "definition": "a long pole with a wide, flat part at one end, used for rowing a boat:",
    "imageUrl": "/images/image_2024-11-20_130956714.png"
  },
  {
    "word": "goop",
    "definition": "any thick liquid or sticky substance"
  },
  {
    "word": "stilt ",
    "definition": "one of a set of long pieces of wood or metal used to support a building so that it is above the ground or above water:",
    "imageUrl": "/images/image_2024-11-24_130335318.png"
  },
  {
    "word": "ominous",
    "definition": "suggesting something unpleasant will happen:\nan ominous silence, fr: sinistre"
  },
  {
    "word": "Attic",
    "definition": "the space or room at the top of a building, under the roof, often used for storing things:",
    "imageUrl": "/images/image_2024-11-25_123637226.png"
  },
  {
    "word": "kitty",
    "definition": "an amount of money that is made up of small amounts given by different people, used by them for an agreed purpose:"
  },
  {
    "word": "covert",
    "definition": "hidden or secret:\ncovert military operations"
  },
  {
    "word": "conjecture",
    "definition": "to guess, based on the appearance of a situation and not on proof:\nWe'll never know exactly how she died; we can only conjecture. fr : supposer *hypothese"
  },
  {
    "word": "manic",
    "definition": "very excited or ancious"
  },
  {
    "word": "ditto",
    "definition": "me too"
  },
  {
    "word": "moldy",
    "definition": "old-fashioned; outmoded * slang"
  },
  {
    "word": "all bets are off",
    "definition": "used to describe a situation in which it is impossible to be sure about what will happen"
  },
  {
    "word": "Avert",
    "definition": "to prevent something bad from happening:\nto avert a crisis/conflict/strike/famine\n\nto turn away your eyes or thoughts:\nI averted my gaze/eyes while he dressed."
  },
  {
    "word": "totes",
    "definition": "sed as a short form of totally to emphasize what you are saying:\nYou're totes right."
  },
  {
    "word": "chestnuts",
    "definition": "the nut in the picture + can refer to the color",
    "imageUrl": "/images/image_2024-12-20_142544669.png"
  },
  {
    "word": "Reluctance",
    "definition": "an unwillingness to do something:\nI accepted his resignation with great reluctance."
  },
  {
    "word": "wrench",
    "definition": "cle a molette",
    "imageUrl": "/images/image_2024-12-20_142753263.png"
  },
  {
    "word": "To comp",
    "definition": "\"offrir gratuitement\" ou \"prendre en charge le coût de quelque chose,\"\n\n\"The restaurant comped our meal after the mistake"
  },
  {
    "word": "hanker ",
    "definition": "to have a strong desire for something:"
  },
  {
    "word": "heap",
    "definition": "an untidy pile or mass of things:/ verb : to put things in a pile:",
    "imageUrl": "/images/image_2024-12-27_143621272.png"
  },
  {
    "word": "abode",
    "definition": "the place where someone lives:"
  },
  {
    "word": "creature of habit",
    "definition": "a person who follows an unvarying routine."
  },
  {
    "word": "crest",
    "definition": "the top or highest part of something such as a wave or a hill:\nthe crest of a hill/wave"
  },
  {
    "word": "adorn",
    "definition": "to add something decorative to a person or thing:"
  },
  {
    "word": "mire",
    "definition": "an area of deep, wet, sticky earth / an unpleasant situation that is difficult to escape/ mired : to be involved in a difficult situation, especially for a long period of time:"
  },
  {
    "word": "eavesdrop",
    "definition": "to listen to someone's private conversation without them knowing:"
  },
  {
    "word": "ghastly",
    "definition": "extremely bad or ugly: ghastly weather, ghastly mistake"
  },
  {
    "word": "wield ",
    "definition": "to have or use power, authority, or influence, or to hold and use a weapon:\nUnder the new city charter, the mayor wields most of the power."
  },
  {
    "word": "swine",
    "definition": "a person whom you consider to be extremely unpleasant and unkind:"
  },
  {
    "word": "steep",
    "definition": "A steep rise or fall is one that goes very quickly from low to high or from high to low:"
  },
  {
    "word": "arse",
    "definition": " a rude word for the part of your body that you sit on / an offensive word for a stupid person"
  },
  {
    "word": "downright",
    "definition": "actually or completely:\nTheir working conditions were downright unhealthy."
  },
  {
    "word": "makeshift",
    "definition": "temporary and of low quality, but used because of a sudden need: 9edawi"
  },
  {
    "word": "tycoon",
    "definition": "a person who has succeeded in business or industry and has become very rich and powerful:"
  },
  {
    "word": "damp",
    "definition": "slightly wet, especially in a way that is not pleasant or comfortable:\nThe grass is still damp."
  },
  {
    "word": "backtrack",
    "definition": "to go back the same way you came, or to consider information again:/If you backtrack from something you previously said or agreed to do, you begin to stop supporting it:"
  },
  {
    "word": "bungle",
    "definition": "to do something wrong, in careless or stupid way ( gacher, bacler .. ) The police bungled the investigation."
  },
  {
    "word": "hasty",
    "definition": "Hasty actions are done in a hurry, sometimes without the necessary care or thought:\nHe warned against making hasty decisions."
  },
  {
    "word": "relay",
    "definition": "To pass on information or a message, or transmit or broadcast: I relayed the news to the others. / A team or system for passing tasks or objects\nExample: The runners competed in the 4x100m relay race."
  },
  {
    "word": "Faze",
    "definition": "to surprise and worry someone:\nNo one is fazed by the sight of guns here any more./ to upset or confuse someone:Speaking in public does not faze her."
  },
  {
    "word": "first string ",
    "definition": "the best players of a team, who usually play at the beginning of a match:/ the top person or people in a group:"
  },
  {
    "word": "demise ",
    "definition": "the end of something that was previously considered to be powerful, such as a business, industry, or system:\ndemise of The demise of the company was sudden and unexpected. / the death of a person:"
  },
  {
    "word": "in the ballpark",
    "definition": " If something is \"in the ballpark,\" it means it's close to the expected range or acceptable level"
  },
  {
    "word": "scant ",
    "definition": "very little and not enough:\nHe pays scant attention to the needs of his children."
  },
  {
    "word": "hay",
    "definition": "tben",
    "imageUrl": "/images/image_2025-02-06_123359545.png"
  },
  {
    "word": "dork ",
    "definition": "a person who is physically or socially awkward or not fashionable:"
  },
  {
    "word": "signs",
    "definition": ".",
    "imageUrl": "/images/image_2025-02-13_135853472.png"
  },
  {
    "word": "Mouthguard",
    "definition": "a device that can be put inside the mouth in order to protect the teeth and gums, for example when playing sport:",
    "imageUrl": "/images/image_2025-02-13_135914647.png"
  },
  {
    "word": "Beacon",
    "definition": "a good example that gives people hope or encouragement:She was a beacon of hope in troubled times./a light or fire in a place that is easy to see, such as on the top of a hill, that acts as a warning or signal:",
    "imageUrl": "/images/image_2025-02-13_140025338.png"
  },
  {
    "word": "Calloused",
    "definition": "If feet or hands are calloused, they are covered with hard areas of skin:",
    "imageUrl": "/images/image_2025-02-13_140042162.png"
  },
  {
    "word": "Quilt",
    "definition": "couette",
    "imageUrl": "/images/image_2025-02-13_140101188.png"
  },
  {
    "word": "Wedge",
    "definition": "a piece of metal, wood, rubber, etc. with a pointed edge at one end and a wide edge at the other, either pushed between two objects to keep them still or forced into something to break pieces off it\n\nto make something stay in a particular position by using a wedge:\n\nto put something into a very small or narrow space, so that it cannot move easily:",
    "imageUrl": "/images/image_2025-02-13_140137344.png"
  },
  {
    "word": "mould",
    "definition": "Moule dyal patisserie\n\nAnd \n\nIf someone is from or in a particular mould, they have the characteristics typical of a certain type of person: He's cast in a very different mould from his brother.\n\nAnd\n\nto make a soft substance have a particular shape:\n\nAnd\n\nto try to change or influence someone:",
    "imageUrl": "/images/image_2025-02-13_140159246.png"
  },
  {
    "word": "Tangerine",
    "definition": "Mandarine",
    "imageUrl": "/images/image_2025-02-13_140327271.png"
  },
  {
    "word": "Seamstress",
    "definition": "Couturiere",
    "imageUrl": "/images/image_2025-02-13_140350314.png"
  },
  {
    "word": "Skewer",
    "definition": "9etban",
    "imageUrl": "/images/image_2025-02-13_140409352.png"
  },
  {
    "word": "Shoe-horn",
    "definition": "Verb : force into an inadequate space.",
    "imageUrl": "/images/image_2025-02-13_140424440.png"
  },
  {
    "word": "Swab",
    "definition": "As a verb: \"Prélever un échantillon avec un écouvillon\" or \"Nettoyer avec un tampon\"",
    "imageUrl": "/images/image_2025-02-13_140440373.png"
  },
  {
    "word": "Pouch",
    "definition": ".",
    "imageUrl": "/images/image_2025-02-13_140456806.png"
  },
  {
    "word": "Vulture",
    "definition": ".",
    "imageUrl": "/images/image_2025-02-13_140521966.png"
  },
  {
    "word": "Breakwater",
    "definition": "A breakwater is a structure built offshore to protect a coast or harbor from the force of waves, providing a calm area for ships and reducing coastal erosion.",
    "imageUrl": "/images/image_2025-02-13_140537645.png"
  },
  {
    "word": "Duct",
    "definition": "a tube or pipe that carries liquid or air, especially in and out of buildings or through the body:",
    "imageUrl": "/images/image_2025-02-13_140556339.png"
  },
  {
    "word": "Gutter ",
    "definition": ".",
    "imageUrl": "/images/image_2025-02-13_140610201.png"
  },
  {
    "word": "Cloth",
    "definition": ".",
    "imageUrl": "/images/image_2025-02-13_140621186.png"
  },
  {
    "word": "knuckle",
    "definition": "one of the joints of the fingers",
    "imageUrl": "/images/image_2025-02-16_150755716.png"
  },
  {
    "word": "sag",
    "definition": "to drop down to a lower level in the middle:\nThe shelf sagged under the weight of the heavy books./to become weaker:"
  },
  {
    "word": "droop",
    "definition": "to bend or hang down heavily:\nThe flowers were drooping in the heat./If your spirits (= feelings of happiness) droop, you start to feel less happy and energetic."
  },
  {
    "word": "Kiln",
    "definition": "a type of large oven used for making bricks and clay objects hard after they have been shaped",
    "imageUrl": "/images/image_2025-02-17_121055857.png"
  },
  {
    "word": "bundle (someone) up",
    "definition": "to put warm clothes on yourself or someone else:The kids were bundled up in coats and scarves."
  },
  {
    "word": "Gleam",
    "definition": "to produce or reflect a small, bright light:"
  },
  {
    "word": "Attire",
    "definition": "clothes, especially of a particular or formal type:"
  },
  {
    "word": "Char",
    "definition": "to burn and become black or to burn something so that it becomes black:\nGrill the peppers until the skin starts to char."
  },
  {
    "word": "Frisky ",
    "definition": "means energetic, playful, or lively. It can describe a person, an animal, or even a mood. My dog gets really frisky when he sees other dogs at the park"
  },
  {
    "word": "forgo ",
    "definition": "to not have or do something enjoyable:\nI shall have to forgo the pleasure of seeing you this week."
  },
  {
    "word": "patronize",
    "definition": "to speak to or behave towards someone as if they are stupid or not important: Stop patronizing me - I understand the play as well as you do."
  },
  {
    "word": "To be swamped ",
    "definition": " means to be extremely busy or overwhelmed with work, tasks, or responsibilities"
  },
  {
    "word": "strangle",
    "definition": "etrangler"
  },
  {
    "word": "Strain",
    "definition": "1- Tension / Pression – when referring to stress or pressure:\n\nMental strain → Tension mentale\n\nStrain on resources → Pression sur les ressources\n\n2-Effort / Fatigue – when talking about physical or emotional effort:\n\nHe felt the strain of the work → Il a ressenti la fatigue du travail\n\n3-Entorse / Foulure – in medical terms, referring to a muscle strain:\n\nA muscle strain → Une entorse musculaire"
  },
  {
    "word": "Strain every nerve / Strain your eyes ",
    "definition": "to make the greatest possible effort:"
  },
  {
    "word": "Barge ",
    "definition": "to hurry somewhere or through a place in a rude and forceful way:\nThey barged through the crowds. / a long boat with a flat bottom, used for carrying heavy loads"
  },
  {
    "word": "be privy to something",
    "definition": "having secret knowledge:\nOnly top management was privy to (= knew about) the proposed merger."
  },
  {
    "word": "Cooped up",
    "definition": "If you are cooped up somewhere, you are in a small closed space from which you cannot escape, or you feel as if you are:"
  },
  {
    "word": "hit the sack",
    "definition": " to go to bed in order to sleep:"
  },
  {
    "word": "Wool",
    "definition": "the soft, thick hair that grows on the bodies of sheep and some other animals:",
    "imageUrl": "/images/image_2025-04-04_113548938.png"
  },
  {
    "word": "prim",
    "definition": "very formal and correct in behaviour and easily shocked by anything rude:"
  },
  {
    "word": "Nibble",
    "definition": "to eat something by taking a lot of small bites:"
  },
  {
    "word": "Biopic",
    "definition": "a film about the life of a real person"
  },
  {
    "word": "Precipice",
    "definition": "a very steep side of a cliff or a mountain:",
    "imageUrl": "/images/image_2025-04-10_130601433.png"
  },
  {
    "word": "ingot",
    "definition": "lingot",
    "imageUrl": "/images/image_2025-04-13_191955139.png"
  },
  {
    "word": "cynic",
    "definition": "a person who believes that other people are interested only in themselves and therefore doubts that they can be good"
  },
  {
    "word": "run on ",
    "definition": "If an event runs on, it continues for longer than expected:\nrun on for The game/speech/discussion ran on for hours."
  },
  {
    "word": "prop something against something",
    "definition": "to support something physically, often by leaning it against something else or putting something under it: I propped my bike against the wall.\n\nan object used by the actors performing in a play or film:\nThe set is minimal and the only props used in the show are a table, a chair, and a glass of water."
  },
  {
    "word": "rando",
    "definition": "an unknown or unexpected person:"
  },
  {
    "word": "redux",
    "definition": "(often used in the titles of films and video games) brought back: \"Apocalypse Now Redux\" → a re-released, extended version of the original film.\n\n\"80s fashion redux\" → 80s fashion making a comeback."
  },
  {
    "word": "Klutzy",
    "definition": "silly and clumsy (= moving awkwardly and often having accidents):"
  },
  {
    "word": "Blare",
    "definition": "to make a very loud noise:Music blared from a radio."
  },
  {
    "word": "Claw",
    "definition": "Makhalib"
  },
  {
    "word": "Badger",
    "definition": "to persuade someone by telling them repeatedly to do something, or to question someone repeatedly:Stop badgering me - I'll do it when I'm ready.\n\nAlso it's an animal fr : blaireau"
  },
  {
    "word": "on-brand",
    "definition": "typical of a person:\nAlways late - that's so on-brand.\n\nhelping a company present the image of itself and its products that it wants to present:We have an on-brand internal culture."
  },
  {
    "word": "splurge",
    "definition": "to spend a lot of money on buying goods, especially expensive goods:I can happily splurge 3,000 pounds in one day."
  },
  {
    "word": "Tack",
    "definition": "a small, sharp nail with a flat end",
    "imageUrl": "/images/image_2025-04-23_125924420.png"
  },
  {
    "word": "All hands on deck",
    "definition": "a particular situation requires everyone to work hard in order to achieve an aim. We had less than three weeks to organize the wedding, so it was all hands on deck."
  },
  {
    "word": "beak",
    "definition": "bec, men9ar",
    "imageUrl": "/images/image_2025-04-24_134036392.png"
  },
  {
    "word": "treeesttwerwe",
    "definition": "ttttt"
  },
  {
    "word": "Seer",
    "definition": "a person who says he or she can see what will happen in the future"
  },
  {
    "word": "Stoked",
    "definition": "excited and very happy about something:"
  },
  {
    "word": "Psyched",
    "definition": "excited"
  },
  {
    "word": "Pervasive",
    "definition": "present or noticeable in every part of a thing or place:\nThe influence of Freud is pervasive in her books. fr : envahissant"
  },
  {
    "word": "Quaff",
    "definition": "to drink something quickly or in large amounts"
  },
  {
    "word": "tatty",
    "definition": "old and in bad condition"
  },
  {
    "word": "Succint",
    "definition": "said in a clear and short way; expressing what needs to be said without unnecessary words:\nKeep your letter succinct and to the point."
  },
  {
    "word": "Still on the loose",
    "definition": "means that someone or something — usually a person or animal — has escaped or is not yet captured and is still free, often when they are considered dangerous or wanted."
  },
  {
    "word": "At large ",
    "definition": "A person who is at large is not in prison:\nThe escaped prisoners are still at large.\n\n-generally"
  },
  {
    "word": "throughput",
    "definition": "an amount of work, etc. done in a particular period of time:\nWe need to improve our throughput because demand is high at the moment."
  },
  {
    "word": "Fuzzy ",
    "definition": "Blurry or not clear (visual or conceptual):\nFlou\n\nA fuzzy photo → Une photo floue\n\n\nIn logic or computing (e.g., fuzzy logic):\nFlou\n\nFuzzy logic → Logique floue"
  },
  {
    "word": "Pedantic",
    "definition": "giving too much attention to formal rules or small details:"
  },
  {
    "word": "Stand in ",
    "definition": "to do the job that another person was going to do or usually does, or to take that person's place at an event, because they cannot be there:\nPaula stood in for Jane, while Jane was on holiday. fr : Remplacer (quelqu’un)"
  },
  {
    "word": "Comprise",
    "definition": " Être composé de / se composer de\nThe committee comprises ten members.\n→ Le comité est composé de dix membres.\n\n2. Comprendre (in a more formal sense)\nThe package comprises several components.\n→ Le paquet comprend plusieurs composants."
  },
  {
    "word": "Curtail",
    "definition": "to stop something before it is finished, or to reduce or limit something:\nto curtail your holiday/spending"
  },
  {
    "word": "Stipulate ",
    "definition": "fr : stipule, ar : ينص على \nThe contract stipulates a deadline.\n→ ينص العقد على موعد نهائي."
  },
  {
    "word": "Stride ",
    "definition": " As a verb (to walk with long, confident steps):\nFrench:\nMarcher à grands pas\nHe strode into the room. → Il est entré dans la pièce à grands pas.\n\nArabic:\nيخطو بخطى واسعة\nHe strode forward confidently. → تقدّم بخطى واسعة وواثقة.\nFigurative meaning (progress, especially significant)\n\nFrench: progrès important"
  },
  {
    "word": "exert",
    "definition": "to use something such as authority, power, influence, etc. in order to make something happen:\nexert your influence If you were to exert your influence they might change their decision."
  },
  {
    "word": "Conscientious",
    "definition": "putting a lot of effort into your work:\na conscientious student"
  },
  {
    "word": "Compel",
    "definition": "to force someone to do something:\nAs a schoolboy he was compelled to wear shorts even in winter.\n\nto produce a strong feeling or reaction:\nOver the years her work has compelled universal admiration and trust."
  },
  {
    "word": "Disgruntled",
    "definition": "unhappy, annoyed, and disappointed about something: A disgruntled former employee is being blamed for the explosion."
  },
  {
    "word": "Meld",
    "definition": "to (cause something to) combine with something else:\nSeveral problems had melded together. fr : fusionner"
  },
  {
    "word": "Startle ",
    "definition": "to surprise a person or animal:\nShe startled him when she said hello. fr : Surprendre,  Faire sursauter"
  },
  {
    "word": "Woe",
    "definition": "bad troubles causing much suffering:\nShe poured out her tale of woe.\n\nextreme sadness:\nHer face was lined and full of woe"
  },
  {
    "word": "Bunk bed",
    "definition": "Lit superposé",
    "imageUrl": "/images/tuffing-bunk-bed-frame-dark-gray__1205593_pe907156_s5.webp"
  },
  {
    "word": "Rolling in it",
    "definition": "informal expression that means someone has a lot of money or is very wealthy."
  },
  {
    "word": "out/up the wazoo",
    "definition": "in large quantities:\nWe have tourists here out the wazoo."
  },
  {
    "word": "Rubble",
    "definition": "the piles of broken stone and bricks, etc. that are left when a building falls down or is destroyed: fr . les décombres",
    "imageUrl": "/images/rubble_noun_002_31672.jpg"
  },
  {
    "word": "Impel",
    "definition": "means to drive or urge someone to do something, often by moral force or internal pressure.\n\n\nfr : pousser\nA sense of duty impelled him to act.\n→ Un sentiment de devoir l’a poussé à agir.\n\nShe was impelled by compassion.\n→ Elle était poussée par la compassion."
  },
  {
    "word": "Carve out ",
    "definition": "1. se tailler – create/establish (e.g. a role, career)\n  → She carved out a career → Elle s’est taillé une carrière\n2. dégager / réserver – allocate time/space\n  → Carve out time → Dégager du temps\n3. découper / tailler – cut out physically\n  → Carve out a section → Découper une partie"
  },
  {
    "word": "Trailer / camper",
    "definition": "caravane"
  },
  {
    "word": "Ilk",
    "definition": "A particular type / kind \n\nof that ilk They do not give children chicken nuggets, potato smiley faces, or processed foods of that ilk."
  },
  {
    "word": "Shag",
    "definition": "To have sex : They had a quick shag\n- it can mean a haircut, carpet type, bird"
  },
  {
    "word": "Abet",
    "definition": "to help or encourage a person or thing to do something, esp. something wrong or illegal:\nShady lawyers abetted the company’s officers in stealing the funds. être complice de"
  },
  {
    "word": "Rambunctious ",
    "definition": "full of energy and difficult to control:\nrambunctious children"
  },
  {
    "word": "Rowdy",
    "definition": "noisy and possibly violent:\na rowdy party\nrowdy behaviour"
  },
  {
    "word": "Twerp ",
    "definition": "stupid person"
  },
  {
    "word": "Sly",
    "definition": "deceiving people in a clever way in order to get what you want:\nHe's a sly old devil - I wouldn't trust him with my money."
  },
  {
    "word": "Devious",
    "definition": "Devious people or plans and methods are dishonest, often in a complicated way, but often also clever and successful:\n\nfr : surnois"
  },
  {
    "word": "Bulb",
    "definition": "a round root of some plants from which the plant grows:\n\nor light bulb"
  },
  {
    "word": "Hindsight",
    "definition": "It refers to understanding a situation only after it has happened.\n\n\"In hindsight, I should have taken the job.\"\n→ \"Avec le recul, j’aurais dû accepter ce poste.\""
  },
  {
    "word": "Markdown",
    "definition": " reduction in the price of something:\nWe're offering a ten percent markdown on selected items."
  },
  {
    "word": "Stern ",
    "definition": "severe, or showing disapproval:\na stern look/warning/voice. fr : Sévère"
  },
  {
    "word": "Reckon ",
    "definition": "to think or believe:\nI reckon it's going to rain.\n\nto calculate an amount:\nAngela quickly reckoned the amount on her fingers.\n\nReckoning can have the previous meanings+ judgement or accountability The day of reckoning has come.\n→ L’heure du jugement est arrivée."
  },
  {
    "word": "barren",
    "definition": "unable to produce plants or fruit:\nWe drove through a barren, rocky landscape. fr : steril"
  },
  {
    "word": "throwdown",
    "definition": ": A physical or verbal confrontation; a showdown between rivals.\n\n“There was a serious throwdown at the bar last night.”\n\n\nA spirited contest — often in sports, cooking, rap battles, etc.\n\n“The chefs are ready for the ultimate throwdown.” \n\nfr: bagarre ou defi"
  },
  {
    "word": "Stinger",
    "definition": "he pointed part of an insect, plant, or animal that stings. fr :dard \nsting, fr : piquer"
  },
  {
    "word": "Feral",
    "definition": "existing in a wild state, especially describing an animal:\nferal dogs/cats\n\nfr: sauvage "
  },
  {
    "word": "Haze ",
    "definition": "- something such as heat or smoke in the air that makes it less clear, so that it is difficult to see well: fr : brume \n\n- Mental confusion / Daze"
  },
  {
    "word": "Snag ",
    "definition": "-a problem, difficulty, or disadvantage:\nWe don't anticipate any snags in/with the negotiations.\n\n-\"Accrocher\" or \"s'accrocher\"\n\nMy sweater snagged on the door handle. → Mon pull s’est accroché à la poignée de porte.\n\n- \"attraper\"\n\nI managed to snag a ticket. → J’ai réussi à choper un billet."
  },
  {
    "word": "Oblivion",
    "definition": "-L’oubli\n\nHis name faded into oblivion. → Son nom est tombé dans l’oubli.\n\n-L’inconscience or l’oubli total\n\nHe drank himself into oblivion. → Il a bu jusqu’à l’inconscience.\n\n-L’annihilation or la disparition totale (more poetic or dramatic)\n\nThe city was reduced to oblivion. → La ville a été réduite à néant."
  },
  {
    "word": "Barf",
    "definition": "To vomit / the substance that comes out of your mouth when you vomit:"
  },
  {
    "word": "Flunk",
    "definition": "to fail an exam or course of study:\nI flunked my Biology exam."
  },
  {
    "word": "wind up",
    "definition": "to close a business or organization:\nLawyers were called in to wind up the company.\n\nto find yourself in an unexpected and usually unpleasant situation, especially as a result of what you do:\nIf he keeps doing stuff like that he's going to wind up in prison!\n\n\nto end, or to make an activity end:\nI think it's about time we wound this meeting up."
  },
  {
    "word": "Cleat",
    "definition": "Crampons",
    "imageUrl": "/images/image_2025-06-08_191606359.png"
  },
  {
    "word": "Exude",
    "definition": "If you exude love, confidence, pain, etc., you show that you have a lot of that feeling:\nexude confidence She just exudes confidence."
  },
  {
    "word": "Wear thin",
    "definition": "It means something is losing its effect, patience, or appeal — often because it's been repeated too much or is becoming annoying or exhausting.\n\nExamples:\n\n\"His excuses are starting to wear thin.\" \"My patience is wearing thin.\""
  },
  {
    "word": "chop-chop",
    "definition": "used to tell someone to hurry:\nCome on, chop-chop, we're late!"
  },
  {
    "word": "Uncharted",
    "definition": "completely new and not previously described or experienced, and therefore possibly difficult to deal with: fr : inexploré"
  },
  {
    "word": "Outcast",
    "definition": "a person who has no place in their society or in a particular group, because the society or group refuses to accept them:"
  },
  {
    "word": "Garment",
    "definition": "a piece of clothing"
  },
  {
    "word": "fleck",
    "definition": "a small mark, esp. of a different color:\nI got a few flecks of paint on the window when I was painting the frames."
  },
  {
    "word": "Topple",
    "definition": "to lean forward and fall:\nA large tree was toppled by the wind.\n\nto remove a person or organization from a position of power:\nThis was a secret bid to topple the chairman and take his job.\n"
  },
  {
    "word": "Lapse",
    "definition": "a temporary failure:\na lapse of concentration\n\n\na period of time passing between two things happening:\na time lapse/a lapse of time"
  },
  {
    "word": "Bicker",
    "definition": "to argue about things that are not important:\nWill you two stop bickering!"
  },
  {
    "word": "Drawn-out",
    "definition": "lasting longer than is usual or necessary:\nWe had another drawn-out discussion after the meeting ended."
  },
  {
    "word": "Agita",
    "definition": "great worry or nervousness:\nThe prospect of taking more risks gave them all agita."
  },
  {
    "word": "Hone",
    "definition": "-to direct something such as an ability to make it more effective:\nHe helps performers hone their skills as dancers and singers. ar : sa9l \n\n-rendre un objet (comme un couteau) plus tranchant.\n\nTo hone a blade → Affûter une lame ou Aiguiser une lame"
  },
  {
    "word": "Vindicate",
    "definition": "-to prove that someone is not guilty or is free from blame, after other people blamed them:\nThey said they welcomed the trial as a chance to vindicate themselves.\n\n-to prove that what someone said or did was right or true, after other people thought it was wrong:\nThe decision to include Morris in the team was completely vindicated when he scored two goals."
  },
  {
    "word": "Feral",
    "definition": "existing in a wild state, especially describing an animal that was previously kept by people:\nferal dogs/cats"
  },
  {
    "word": "Boar",
    "definition": "Sanglier",
    "imageUrl": "/images/image_2025-06-15_100339479.png"
  },
  {
    "word": "Capped",
    "definition": "Plafonné → Capped at 5% → Plafonné à 5 %\n\nRecouvert → Snow-capped mountain → Montagne enneigée\n\nBouché / Fermé → Capped bottle → Bouteille bouchée\n\nSélectionné (en sport) → He was capped 10 times → Il a été sélectionné 10 fois"
  },
  {
    "word": "marksmanship",
    "definition": "skill in shooting:\nThe competitors display their marksmanship at targets along the ski route."
  },
  {
    "word": "amiss",
    "definition": "wrong, not suitable, or not as expected:\nI could see by the look on their faces that something was amiss."
  },
  {
    "word": "out of whack",
    "definition": "not operating correctly or looking right:My computer's all out of whack."
  },
  {
    "word": "Toss up",
    "definition": "to throw a coin up into the air and guess which side will land facing up, as a way of making a decision:\nLet's toss up to see who goes first.  \nIf you describe a situation as a toss-up, you mean that either of two possibilities is equally likely:"
  },
  {
    "word": "fend for yourself",
    "definition": "to take care of and provide for yourself without depending on anyone else:\nThe corporation will no longer receive a government subsidy, and must fend for itself financially."
  },
  {
    "word": "I have to get jamming",
    "definition": "\"I need to get going\" or \"I have to start working/moving quickly.\" \nTo get going / leave\n→ \"I have to get jamming, or I’ll be late!\"\n\nTo start working hard or energetically\n→ \"I have to get jamming on this project if I want to finish by tonight.\""
  },
  {
    "word": "to be tied up",
    "definition": "To be very busy or occupied with something\n(It doesn't mean someone is literally tied with rope)\nSorry, I can’t talk right now — I’m tied up in a meeting"
  },
  {
    "word": "to bend over backwards",
    "definition": "To make a great effort to help someone or to do something, even if it's difficult or inconvenient.\n\n\"She bent over backwards to make her guests feel comfortable.\"\n→ She did everything possible to please them."
  },
  {
    "word": "Fluke",
    "definition": "A lucky or accidental success — something that happens by chance, not skill.\n\n\"That goal was a total fluke!\"\n→ It happened by luck, not on purpose."
  },
  {
    "word": "Ensnare",
    "definition": "to catch or get control of something or someone:Spiders ensnare flies and other insects in their webs."
  },
  {
    "word": "Rub someone the wrong way",
    "definition": "To annoy, irritate, or offend someone — often unintentionally.\n\"I don't know what it is about him, but he just rubs me the wrong way.\"\n→ He annoys me, even if I can't explain why."
  },
  {
    "word": "Whatnot",
    "definition": "\"And other things like that\" or \"etcetera\".\n\n\"We packed sandwiches, drinks, chips, and whatnot for the picnic.\"\n"
  },
  {
    "word": "Buzzkill",
    "definition": "something or someone that spoils people's feelings of excitement, enjoyment, or pleasure:"
  },
  {
    "word": "grifter",
    "definition": "someone who gets money dishonestly by tricking people: fr : arnaqueur"
  },
  {
    "word": "Arouse",
    "definition": "to cause someone to have a particular feeling:\nIt's a subject that has aroused a lot of interest.\nOur suspicions were first aroused when we heard a muffled scream."
  },
  {
    "word": "Gab",
    "definition": "to talk continuously and eagerly, especially about things that are not important:\nI got so bored listening to him gabbing on about nothing."
  },
  {
    "word": "bide your time",
    "definition": "to wait patiently for a good opportunity to do something:\nHe’s just biding his time until a permanent job opens up."
  },
  {
    "word": "Ward",
    "definition": "Hospital ward → salle or service\n\nLegal ward (person under guardianship) → pupille\n\nElectoral ward → circonscription\n\nTo ward off → repousser or écarter"
  },
  {
    "word": "whimsical",
    "definition": "unusual and strange in a way that might be funny or annoying:\na whimsical tale.\nWhimsical also describes actions that change suddenly and for no obvious reason:\nUnfortunately, his decisions are often whimsical."
  },
  {
    "word": "wedded to something",
    "definition": "firmly believing in or supporting an idea, theory, or suggestion and unwilling to change it:\nManagers can become wedded to a certain way of doing things.\nsynonyme : dead set on"
  },
  {
    "word": "To bolt (verb )",
    "definition": "To run away suddenly and quickly.\nThe deer bolted when it saw the hunter.\n\n\nTo lock a door or window with a bolt.\n\nTo eat food very fast."
  },
  {
    "word": "Keepsake",
    "definition": "a small present, usually not expensive, that is given to you by someone so that you will remember that person"
  },
  {
    "word": "Leery",
    "definition": "not trusting someone or something and usually avoiding him, her, or it if possible:\nI've always been a little leery of authority figures."
  },
  {
    "word": "Waddle",
    "definition": "(usually of a person or animal with short legs and a fat body) to walk with short steps, moving the body from one side to the other:\nThe ducks waddled down to the river. fr : dandiner"
  },
  {
    "word": "spew",
    "definition": "If something spews liquid or gas, or liquid or gas spews from something, it flows out in large amounts:\nThe volcano spewed a giant cloud of ash, dust, and gases into the air."
  },
  {
    "word": "elbow grease",
    "definition": "a lot of physical effort: The polish needs a certain amount of elbow grease to apply."
  },
  {
    "word": "Landslide",
    "definition": "the winning of an election with an extremely large number of votes:\na landslide victory"
  },
  {
    "word": "Ties the knot",
    "definition": "to get married"
  },
  {
    "word": "Urn",
    "definition": ".",
    "imageUrl": "/images/urn_noun_002_39726.jpg"
  },
  {
    "word": "Sieve",
    "definition": "Passoire",
    "imageUrl": "/images/sieve_noun_002_33743.jpg"
  },
  {
    "word": "hold water",
    "definition": "If a reason, argument, or explanation holds water, it is true:\nHer alibi just didn't hold water."
  },
  {
    "word": "pep",
    "definition": "energy, or a willingness to be active"
  },
  {
    "word": "bloke / chap",
    "definition": "a man"
  },
  {
    "word": "Vindicate",
    "definition": "to prove that what someone said or did was right or true, after other people thought it was wrong:\nThe decision to include Morris in the team was completely vindicated when he scored two goals."
  },
  {
    "word": "pipe dream",
    "definition": "an idea or plan that is impossible or very unlikely to happen:\n"
  },
  {
    "word": "Jolly",
    "definition": "happy and smiling"
  },
  {
    "word": "contiguous",
    "definition": "next to or touching another, usually similar, thing:\ncontiguous with/to The two states are contiguous with/to each other, but the laws are quite different."
  },
  {
    "word": "loathe",
    "definition": "to hate someone or something:\nFrom an early age the brothers have loathed each other."
  },
  {
    "word": "soothing",
    "definition": "making you feel calm:\nI put on some nice soothing music.\nHer words had a soothing effect."
  },
  {
    "word": "find his stride",
    "definition": "idiom that means someone has found their rhythm, confidence, or an effective way of doing something after a period of uncertainty, difficulty, or adjustment"
  },
  {
    "word": "Take something at face value",
    "definition": "It means to accept something as true or genuine based on its outward appearance or initial presentation, without looking deeper or questioning its sincerity or validity.\n\nHe said he was too busy to help, and I took his excuse at face value, not realizing he was just avoiding the task"
  },
  {
    "word": "Take a stab",
    "definition": "idiom meaning to make an attempt or give it a try\n\nI don't know the answer for sure, but I'll take a stab at it"
  },
  {
    "word": "Jotting",
    "definition": "\"note rapide\" or \"petite note\"\nHe made a few jottings in his notebook."
  },
  {
    "word": "Skirt",
    "definition": "in additionnal of saya\nit can mean avoid or evade "
  },
  {
    "word": "Tug",
    "definition": "a sudden strong pull on something:\nFeeling a tug at his sleeve, he turned to see Joe beside him."
  },
  {
    "word": "Upbeat",
    "definition": "full of hope and happiness: A number of companies remain upbeat about growth prospects in the coming months."
  },
  {
    "word": "Chipper",
    "definition": "very happy:You seem mighty chipper this morning - what's up?"
  },
  {
    "word": "punch up",
    "definition": "to make something more interesting by adding something:\nHe needs some writers to punch up his speeches. \nI like to punch my fruit salad up a little, adding pomegranate seeds and lemon juice."
  },
  {
    "word": "Snap out of it",
    "definition": "to stop experiencing something unpleasant or stop behaving in a negative way:\nI was depressed, and I couldn't snap out of it."
  },
  {
    "word": "Fodder",
    "definition": "food that is given to cows, horses, and other farm animals"
  },
  {
    "word": "Amped",
    "definition": "excited, pumped up"
  },
  {
    "word": "Zesty",
    "definition": "- full of energy and enthusiasm:\na zesty new musical\n\n-full of flavour:\na zesty tomato sauce"
  },
  {
    "word": "To put something on the back burner",
    "definition": "means to postpone it or to give it a lower priority for a period of time.\nMettre sur la glace"
  },
  {
    "word": "Hand over first",
    "definition": "If you make or lose money hand over fist, you make or lose a lot of money very quickly:\nBusiness was good and we were making money hand over fist."
  },
  {
    "word": "slice and dice",
    "definition": "divide (something) into smaller parts, especially in order to analyze it more closely or in different ways."
  },
  {
    "word": "Bring home the bacon",
    "definition": "to earn money for a family to live on:\nI can't sit around all day - someone's got to bring home the bacon."
  },
  {
    "word": "Drive a wedge",
    "definition": "to damage the good relationship that two people or groups of people have:\nIt doesn't make sense to let things that happened in the past drive a wedge between us now."
  },
  {
    "word": "Jumbo",
    "definition": "extremely large:\na jumbo bag of sweets"
  },
  {
    "word": "Wear thin",
    "definition": "If your patience wears thin, you become less and less patient:\nI've warned you several times about being late and my patience is wearing thin.\n\nIf something such as a joke wears thin, it becomes boring or annoying or stops being funny or effective, because it has been seen, heard, or used too much:"
  },
  {
    "word": "Shroud",
    "definition": "a cloth wrapped around a dead body. KFEN"
  },
  {
    "word": "Bash",
    "definition": "to criticize someone severely:\nHe kept bashing local government officials.\n\nto hit hard:\nHe bashed his arm against a shelf.\n\na party:\nHe had a big bash for his 18th birthday."
  },
  {
    "word": "deft",
    "definition": "skilful, clever, masterful, or quick:\nHer movements were deft and quick."
  },
  {
    "word": "Unhinged",
    "definition": "mentally ill:\nI sometimes think that your mother is a little unhinged."
  },
  {
    "word": "Eke",
    "definition": "to use something slowly or carefully because you only have a small amount of it:\nThere wasn't much food left, but we just managed to eke it out.\neke out a living He managed to eke out a living (= earn just enough to live on) one summer by selling drinks on a beach.\n\n\n\nto obtain or win something only with difficulty or great effort:\nThe company expects to eke out a small profit this year."
  },
  {
    "word": "Torment",
    "definition": "great mental suffering and unhappiness, or great physical pain: "
  },
  {
    "word": "epiphany",
    "definition": "a moment when you suddenly feel that you understand, or suddenly become conscious of, something that is very important to you. fr : épiphanie/revelation"
  },
  {
    "word": "Run-in",
    "definition": "an argument, disagreement, or fight:\nShe’d had a run-in with the dog before."
  },
  {
    "word": "Bonehead",
    "definition": "very stupid:\nThat was some bonehead behaviour."
  },
  {
    "word": "swindler",
    "definition": "escroc"
  },
  {
    "word": "Dork",
    "definition": "a person who is physically or socially awkward or not fashionable:\nHe's such a dork, but he's a lovely guy."
  },
  {
    "word": "bib",
    "definition": "a cover made of cloth or plastic that is worn by young children when eating to protect their clothes. Fr : bavoir",
    "imageUrl": "/images/bib_noun_002_03219.jpg"
  }
]